{
  "label": "Gift Certificate Item",
  "id": "giftcertificateitem",
  "supportCustomFields": true,
  "searchOnly": false,
  "supportDeletedRecordSearch": false,
  "fields": [
    {
      "id": "availabletopartners",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Available to Adv. Partners",
      "required": false,
      "help": "Check this box to make this item available to partners with the Advanced Partner Center role for viewing.\n\nThese items are also available to partners with roles that are customized for the Advanced Partner Center and include view, create or edit access to item records."
    },
    {
      "id": "billingschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Billing Schedule",
      "required": false,
      "help": "Choose the billing schedule you want to associate with this item.\n\nWhen an item is associated with a billing schedule, the billing schedule appears by default when the item is added to an order.\n \nNote: Forms must be customized to show schedules on lines. Read Applying Billing Schedules. \n\nClick New to enter a new billing schedule."
    },
    {
      "id": "class",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Class",
      "required": false,
      "help": "Select a class to associate with this item.\n\nClick New to enter a new class record.\n\nGo to <_TABNAME=LIST_CLASS_> > <_TASKCATEGORY=LIST_CLASS_> > Classes for details about existing class records."
    },
    {
      "id": "costestimate",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Item Defined Cost",
      "required": false,
      "help": "Enter an Item Defined Cost amount."
    },
    {
      "id": "costestimatetype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Cost Estimate Type",
      "required": false,
      "help": "The Cost Estimate Type determines what value NetSuite uses to calculate estimated Gross Profit.\n\nThe estimated Gross Profit for Items on a transaction provides the data needed to calculate the total estimated Gross Profit on that transaction.\n\nThe individual line items that you enter in a transaction determine the amounts that post when you process that transaction.\n\nThe following Cost Estimate Types on Items are available:\n\n    * Item Defined Cost - a user-defined amount, entered into the Item Defined Cost field on the Item definition page.\n    * Average Cost - NetSuite calculates an average cost of the units purchased. \n    * Last Purchase Price - This field displays the most recent purchase price of the item as determined by purchase order receipt transactions. \n    * Purchase Price - Price entered that you pay for this item. If you do not enter a price, then the most recent purchase price from purchase orders provides the price for this item by default.\n    * Preferred Vendor Rate - This option is only used if the Multi-Vendor feature is enabled and multiple vendors supply the same item.\n          o First priority is to use the preferred vendor rate if defined on the Item record.\n          o Next priority would be to use the purchase price.\n          o Last priority would be the purchase order rate. (Initially this uses the preferred vendor rate cost, and then after a purchase order is entered, this type uses the most recent actual purchase order rate. Special orders and drop-shipped items use this cost information.)\n    * Derived from member items - Total costs of items currently included in a kit. This Cost Estimate Type only applies to kits and sums the estimated costs of each item in the kit, based on each of their individual Cost Estimate Types. Uses the latest definition of the kit, not its historical definition."
    },
    {
      "id": "createddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Date Created",
      "required": false,
      "help": ""
    },
    {
      "id": "customform",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Custom Form",
      "required": false,
      "help": "Select the form you want to use to enter this record.\n\nYou can select the standard form, a custom form you have already created, or select New to create a custom form."
    },
    {
      "id": "daysbeforeexpiration",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Days Before Expiration",
      "required": false,
      "help": "If you want this item to expire, enter the number of days it should remain active after purchase.\n\nIf this item is downloadable and the same customer purchases this item more than once, the countdown to expiration restarts with each purchase.\n\nNote: If this item is a gift certificate and the buyer lives in California, Connecticut, Louisiana, Massachusetts, New Hampshire, Rhode Island or Washington, by law the gift certificate cannot expire."
    },
    {
      "id": "department",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Department",
      "required": false,
      "help": "Choose a department to associate with this item.\n\nClick New to enter a new department record.\n\nGo to <_TABNAME=LIST_DEPARTMENT_> > <_TASKCATEGORY=LIST_DEPARTMENT_> > Departments for details about existing department records."
    },
    {
      "id": "displayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Display Name/Code",
      "required": false,
      "help": "You can enter an optional name for this item in addition to the Item Name. If you are integrating with a Yahoo! store, this field is imported from Yahoo!.\n\nThe display name prints in the Item column of sales forms. If this item is a member of a kit, this name appears in the Item column when the Print Items box is checked.\n\nIf you do not enter a display name, the item name appears on printed forms."
    },
    {
      "id": "dontshowprice",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Don't Show Price",
      "required": false,
      "help": "Check this box to hide the price of this item online.\n\nThis is useful for items you want to advertise but don't want to sell or for items that you track inventory for and want to display but are offered in combination with other items."
    },
    {
      "id": "excludefromsitemap",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Exclude From Sitemap",
      "required": false,
      "help": "Check this box to exclude a tab, category or item page from the site map."
    },
    {
      "id": "externalid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "ExternalId",
      "required": false,
      "help": ""
    },
    {
      "id": "featureddescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Featured Description",
      "required": false,
      "help": "If this item is displayed on the home page of your Web site, enter a featured description for this item.\n\nThis description appears below the item's store display name on the Home page of your store or site.\n\nYou can enter up to 999 characters including basic HTML code.\n\nEnter and format text using the formatting options, or click the HTML Source Code link to enter HTML."
    },
    {
      "id": "includechildren",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Include Children",
      "required": false,
      "help": "Check the Include Children box to share the item with all the sub-subsidiaries associated with each subsidiary selected in the Subsidiary field.\n\nNote: When sharing items across subsidiaries, all of the options selected on the item record must be compatible across subsidiaries.\n \nFor example, when entering an inventory item to be shared across subsidiaries, you should select Income and Asset accounts on the item record that are also shared across the same subsidiaries."
    },
    {
      "id": "incomeaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Income Account",
      "required": false,
      "help": "Select the income account to associate with this item. When no income account is selected, the item does not show in the Item dropdown list for sales transactions."
    },
    {
      "id": "internalid",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Internal ID",
      "required": false,
      "help": ""
    },
    {
      "id": "isdonationitem",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Variable Amount",
      "required": false,
      "help": "Check this box to set this item as variable-priced. This enables customers to enter their own prices for this item, such as for donations."
    },
    {
      "id": "isfulfillable",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Can be Fulfilled/Received",
      "required": false,
      "help": "Check the Can be Fulfilled/Received box to enable this item to be received and fulfilled during order processing.\n\nClear this box if this item does not require being received and fulfilled.\n\nNote: Once this item has been added to transactions, this setting cannot be changed.\n\nThis field is used when the Advanced Billing and Advanced Shipping features are both enabled."
    },
    {
      "id": "isgcocompliant",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Allow Google Checkout Purchase",
      "required": false,
      "help": "Check this box to make the item available for purchase with Google Checkout."
    },
    {
      "id": "isinactive",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Inactive",
      "required": false,
      "help": "When you check this box, this item will no longer appear on a list unless you check the Show All box at the bottom of the list page."
    },
    {
      "id": "isonline",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Display in Web Store",
      "required": false,
      "help": "Check this box to make this item available online in your Web site.\n\nYou cannot sell this item online unless you check this box."
    },
    {
      "id": "issueproduct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Product Name",
      "required": false,
      "help": "Select the product this item is associated with.\n\nProduct records are tracked with versions and builds for issue management.\n\nTo create product records, go to <_TABNAME=ADMI_ISSUEPRODUCT_> > <_TASKCATEGORY=ADMI_ISSUEPRODUCT_> > Products > New."
    },
    {
      "id": "itemid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Item Name/Number",
      "required": true,
      "help": "Type up to 60 characters for the name of this item. This name appears in lists on transactions.\n\nIf you have the option of entering a display name and do not, the item name prints in the Item column of sales forms.\n\nIf you have the option to enter a vendor name and do not, the item name prints in the Item column of purchase forms. If you have entered a display name, it will print on purchases instead of the item name."
    },
    {
      "id": "itemnumberoptions",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Number Options",
      "required": false,
      "help": ""
    },
    {
      "id": "itemoptions",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Options",
      "required": false,
      "help": ""
    },
    {
      "id": "itemtype",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "lastmodifieddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Last Modified",
      "required": false,
      "help": ""
    },
    {
      "id": "liabilityaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Liability Account",
      "required": true,
      "help": "Select the liabilty account that will be affected by this item. Click New to set up a new account.\n\nGo to Setup > Accounts for details about existing accounts."
    },
    {
      "id": "location",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Location",
      "required": false,
      "help": "Select a location to associate with this item.\nTo use a location, the Multi-Location Inventory feature must be enabled.\n\n    * If the Multi-Location Inventory feature is not enabled:\n\n      Selecting an item record location limits the items that certain roles can access.\n      For example, Role A is set up to access only items associated with Location One. Therefore, employees who have Role A can access only items associated with Location One.\n\n      Note: If the Multi-Location Inventory feature is not enabled, you cannot use this field to track inventory by locations. For example, you cannot track how many widgets you have in stock in Location One.\n\n      For more information click here.\n\n    * If the Multi-Location Inventory feature is enabled:\n\n      Selecting an item record location classifies the item by that location to limit the items that certain roles can access. To track inventory per location, use the Locations subtab at the bottom of this form.\n\n      For more information click here.\n\nSelect New to enter a new location record.\n\nGo to <_TABNAME=LIST_LOCATION_> > <_TASKCATEGORY=LIST_LOCATION_> > Locations for details about existing location records."
    },
    {
      "id": "maxdonationamount",
      "type": "currency2",
      "nlapiSubmitField": false,
      "label": "Maximum Variable Amount",
      "required": false,
      "help": "If you checked the Variable Amount box, enter the maximum amount that can be paid or donated for this item."
    },
    {
      "id": "metataghtml",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Meta Tag HTML",
      "required": false,
      "help": "Enter the Meta Tag HTML you want to appear in the < head > section of this item page.\n\nMeta tags enable your Web site to be found by search engines."
    },
    {
      "id": "nopricemessage",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "No Price Message",
      "required": false,
      "help": "If you opted to not show a price online, enter the message that should show instead of the price.\n\nFor example, you might enter \"Call for Price.\""
    },
    {
      "id": "offersupport",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Offer Support",
      "required": false,
      "help": "Check this box to offer support for this particular item.\n\nBy offering support for items, customers can select on case records which item they are having trouble with."
    },
    {
      "id": "outofstockbehavior",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Out Of Stock Behavior",
      "required": false,
      "help": "Select a custom out of stock behavior for this item. It overwrites the overall site&#x2019;s out of stock behavior. Your choices are:\n\n    * Default - Uses the behavior selected in the Web Store Out of Stock Items field at Setup > Web Site > Setup Tasks > Set Up Web Site > Shopping.\n    * Disallow back orders but display out of stock messages\n    * Allow back orders but display out of stock messages\n    * Remove items when out of stock\n    * Allow back orders with no out of stock message"
    },
    {
      "id": "outofstockmessage",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Out Of Stock Message",
      "required": false,
      "help": "You can enter a custom out of stock message for this item. The message here replaces the default out of stock message."
    },
    {
      "id": "pagetitle",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Page Title",
      "required": false,
      "help": "Enter the text you want to appear as the page's title for this item. This text appears in the browser tab. Use a descriptive title for the item page, this can help achieve better results with search engine ranking."
    },
    {
      "id": "parent",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subitem of",
      "required": false,
      "help": "If you want this item to be a subitem, select the parent item here."
    },
    {
      "id": "relateditemsdescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Related Items Description",
      "required": false,
      "help": "Enter a description for the related items you show with this item in your Web site.\n\nYou can enter up to 999 characters of letters, numbers and basic HTML code.\n\nYou can also clear the View as HTML box below to enter and format text using the formatting options above.  This eliminates the need for HTML code."
    },
    {
      "id": "salesdescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Sales Description",
      "required": false,
      "help": "Enter a sales description for this item.\n\nYou can enter letters and numbers. There is a 999 character limit.\n\nThe sales description displays on transactions such as sales orders, cash sales and invoices.\n\nIf you use the Web Store feature, the sales description displays immediately under the item's store display name on item list pages in your store or site, if you have not entered a store description for an item. Enter the store description on the Store subtab of the item record.\n\nThe sales description also displays by default when the item is in the Web store shopping cart."
    },
    {
      "id": "searchkeywords",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Search Keywords",
      "required": false,
      "help": "Enter alternative search keywords that customers might use to find this item using your Web store&#x2019;s internal search.\n\nThese can include synonyms, acronyms, alternate languages or misspellings.\n\nThese keywords are seen as equally important as the item name when searches are conducted."
    },
    {
      "id": "showdefaultdonationamount",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Show Default Amount",
      "required": false,
      "help": "Check this box to suggest the item's online price for the item.\n\nWhen customers navigate to a donation item, they first see the online price for the item and then can choose to enter any amount they like."
    },
    {
      "id": "sitemappriority",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Sitemap Priority",
      "required": false,
      "help": "Use the Sitemap Priority list to indicate the relative importance of your Web site URLs.\n\nYou can select a priority ranging from 0.0 to 1.0 on item, category, and tab records.\n\nNetSuite assigns the default priority &#x201c;Auto&#x201d; to all new and existing tab, category and item records in your account. The priority is calculated based on the position of the item or category in the hierarchy of your Web site.\n\nFor example, your Web site tabs automatically generate a default priority value of 1.0 because they are top level pages. A category published to a tab gets a priority of 0.5. An item published to a category on a tab gets a priority of 0.3."
    },
    {
      "id": "storedescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Web Store Description",
      "required": false,
      "help": "The store description appears under the item's store display name on item list pages in your store or site.\n\nYou can enter letters, numbers, and basic HTML code.\n\nNote: To make the store description display when an item is in the Web store shopping cart, go to Setup > Web Site > Set Up Web Site. Click the Cart subtab, and check the box next to Store Description."
    },
    {
      "id": "storedetaileddescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Detailed Description",
      "required": false,
      "help": "Enter a detailed description for this item.\n\nWhen your customers click an item's store display name for more information, they see this description.\n\nYou can enter letters, numbers or basic HTML code.\n\nIf you are using Internet Explorer, you can also clear the View Source box below to enter and format text using the formatting options above.  This eliminates the need for HTML code.\n\nIf you do not see the View Source box, make sure Rich Text Editing is enabled at Home > Set Preferences > Appearance."
    },
    {
      "id": "storedisplayimage",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Display Image",
      "required": false,
      "help": "Select an image from your file cabinet to display with this item in your Web site.\n\nUpload images at Lists > Web Site > Images.\n\nYou can automatically resize images less than 5 megapixels in size at Setup > Web Site > Image Resizing."
    },
    {
      "id": "storedisplayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Web Store Display Name",
      "required": false,
      "help": "Enter the name of this item as you want it displayed in your Web site."
    },
    {
      "id": "storedisplaythumbnail",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Display Thumbnail",
      "required": false,
      "help": "Select an image from your file cabinet you want to use as the thumbnail image for this item.\n\nThis image shows with this item before a customer clicks the item for more information.\n\nUpload images at Lists > Web Site > Images.\n\nYou can automatically resize images less than 5 megapixels in size at Setup > Web Site > Image Resizing."
    },
    {
      "id": "storeitemtemplate",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Drilldown Template",
      "required": false,
      "help": "If you have created an item template to display this item in your Web site, select the template here.\n\nCreate item templates at Lists > Item Templates.\n\nYou can set an item template for all your items at Setup > Site Templates > Body."
    },
    {
      "id": "subsidiary",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subsidiary",
      "required": false,
      "help": ""
    },
    {
      "id": "subtype",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "taxschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Tax Schedule",
      "required": true,
      "help": "Select the tax schedule you want to apply to this item.\n\nYou can create new tax schedules at Setup > Accounting > Taxes > Tax Schedules > New."
    },
    {
      "id": "upccode",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "UPC Code",
      "required": false,
      "help": "Enter a maximum of 999 characters in this field to identify an internal name or number to store the item's UPC Code. You can use the text you enter here when adding the item to transactions, searching, or viewing reports.\n    * When you enter text in this field, the SKU/UPC field on item labels displays this UPC Code and prints in UPC bar code format.\n    * When this field is clear, the SKU/UPC field on item labels displays the Item Name/Number and prints in Code-128 bar code format."
    },
    {
      "id": "urlcomponent",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "URL Component",
      "required": false,
      "help": "Enter a short, descriptive name for this item to appear as part of its URL in the Web store.\n\nSetting a name to show in the URL can result in better ranking from search engines.\n\nIf you leave this field blank, NetSuite terms and numbers are used as identifiers in the URL.\n\nNote: Descriptive URL components are case sensitive. Descriptive URLs must match the case used in the URL Component field of an item record to point to the correct page."
    }
  ],
  "sublists": [
    {
      "id": "price",
      "label": "Price Levels",
      "fields": [
        {
          "id": "currency",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        },
        {
          "id": "pricelevel",
          "type": "text",
          "label": "Price Level",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "sitecategory",
      "label": "Web Site List",
      "fields": [
        {
          "id": "category",
          "type": "select",
          "label": "Site Category",
          "required": true,
          "help": ""
        },
        {
          "id": "categorydescription",
          "type": "text",
          "label": "Description",
          "required": false,
          "help": ""
        },
        {
          "id": "isdefault",
          "type": "checkbox",
          "label": "Preferred Category",
          "required": false,
          "help": ""
        },
        {
          "id": "website",
          "type": "select",
          "label": "Site",
          "required": true,
          "help": ""
        }
      ]
    },
    {
      "id": "translations",
      "label": "Item Translation",
      "fields": [
        {
          "id": "displayname",
          "type": "text",
          "label": "Display Name",
          "required": false,
          "help": ""
        },
        {
          "id": "featureddescription",
          "type": "textarea",
          "label": "Featured Description",
          "required": false,
          "help": ""
        },
        {
          "id": "language",
          "type": "text",
          "label": "Language",
          "required": false,
          "help": ""
        },
        {
          "id": "locale",
          "type": "text",
          "label": "",
          "required": false,
          "help": ""
        },
        {
          "id": "nopricemessage",
          "type": "textarea",
          "label": "No Price Message",
          "required": false,
          "help": ""
        },
        {
          "id": "outofstockmessage",
          "type": "textarea",
          "label": "Out Of Stock Message",
          "required": false,
          "help": ""
        },
        {
          "id": "pagetitle",
          "type": "textarea",
          "label": "Page Title",
          "required": false,
          "help": ""
        },
        {
          "id": "salesdescription",
          "type": "textarea",
          "label": "Sales Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedescription",
          "type": "textarea",
          "label": "Store Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedetaileddescription",
          "type": "textarea",
          "label": "Detailed Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedisplayname",
          "type": "text",
          "label": "Store Display Name",
          "required": false,
          "help": ""
        }
      ]
    }
  ],
  "searchFilters": [],
  "searchColumns": [],
  "searchJoins": [],
  "searchData": "item",
  "tabs": [
    {
      "name": "basic",
      "label": "Basic"
    },
    {
      "name": "custom",
      "label": "Custom"
    },
    {
      "name": "history",
      "label": "History"
    },
    {
      "name": "matrix",
      "label": "Matrix"
    },
    {
      "name": "pricing",
      "label": "Pricing"
    },
    {
      "name": "projects",
      "label": "Projects"
    },
    {
      "name": "relitems",
      "label": "Related Items"
    },
    {
      "name": "specials",
      "label": "Specials"
    },
    {
      "name": "store",
      "label": "Store"
    },
    {
      "name": "translation",
      "label": "Translation"
    },
    {
      "name": "vsoepricing",
      "label": "Rev Rec / Amort"
    },
    {
      "name": "workflow",
      "label": "Workflow"
    }
  ],
  "transformTypes": []
}