{
  "label": "Inventory Part",
  "id": "inventoryitem",
  "supportCustomFields": true,
  "searchOnly": false,
  "supportDeletedRecordSearch": false,
  "fields": [
    {
      "id": "alternatedemandsourceitem",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Alternate Source Item",
      "required": false,
      "help": "For demand planning purposes, choose another item if you want to examine the historical sales of an item other than the one on the current record. When this field is left blank, the source for historical data is the original item.\n\nFor example, if you are setting up Item A for demand planning, but Item A does not have an extensive sales history, you can choose Item B as an alternate source for historical data. Then, when demand calculations need to be made for Item A, NetSuite uses Item B&#x2019;s history for the calculations.\n\nNote: You can select only an item that is of the same item type to be an alternate source. For example, if the original item is an inventory item, the alternate source item must also be an inventory item."
    },
    {
      "id": "assetaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Asset Account",
      "required": false,
      "help": "Select the asset account that tracks the value of the inventory on hand for this item. Click &#x2014;New&#x2014; to set up a new account.\n\nGo to Lists > Accounts for details about existing accounts."
    },
    {
      "id": "atpmethod",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Default ATP Method",
      "required": true,
      "help": ""
    },
    {
      "id": "auctionquantity",
      "type": "posinteger",
      "nlapiSubmitField": false,
      "label": "Auction Quantity",
      "required": false,
      "help": ""
    },
    {
      "id": "auctiontype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Auction Type",
      "required": false,
      "help": ""
    },
    {
      "id": "autoleadtime",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Auto-Calculate",
      "required": false,
      "help": "Lead time is the average number of days between ordering this item from the vendor and receiving it.\n    * Check the Auto-Calculate box if you want NetSuite to calculate the lead time based on the most recent order history of this item. This is calculated by taking the number of days between the order entry and receipt on the three most recent purchase orders, and dividing by three.\n          o If there are multiple receipts for the item against the same purchase order, only the first receipt is used for the calculation.\n          o Lead time calculation is not weighted by number of units received.\n          o More recent purchase orders without receipts are ignored.\n    * Clear the Auto-Calculate box to manually enter a lead time value in days. If the Auto-Calculate box is cleared and no value is entered, then the default value from the Set Up Inventory Management page is used."
    },
    {
      "id": "autopreferredstocklevel",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Auto-Calculate",
      "required": false,
      "help": "The preferred stock level is the optimum quantity to maintain in stock of an item.\n\nThe quantity you enter here is used to determine your replenishment needs on the Order Items page. It is the quantity you want to have in stock after an order is placed.\n\n    * Auto-Calculating &#x2013; Check the Auto-Calculate box if you want NetSuite to calculate the preferred stock level based on demand for the item.\n\n      The preferred stock level is calculated as:\n\n      (daily demand * number of days supply preferred).\n\n      If no preferred stock level is identified, then the default preferred stock level is used from the Set Up Inventory Management page.\n\n\n    * Manually Calculating &#x2013; Clear the Auto-Calculate box to manually enter the preferred stock quantity.\n\nThe preferred stock level you set is used to calculate the quantity of items to be ordered on the Order Items page."
    },
    {
      "id": "autoreorderpoint",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Auto-Calculate",
      "required": false,
      "help": "Reorder Point is the quantity level at which you need to reorder or build more of this item.\n\n    * Auto-Calculate &#x2013; Check the Auto-Calculate box to automatically calculate the reorder point based on demand for the item over time. The reorder point depends on the safety stock definition and is calculated as follows:\n          o Without safety stock defined:\n            Reorder point = (average lead time days * demand)\n          o With safety stock defined in days:\n            Reorder point = [(average lead time days + safety stock days) * demand]\n          o With safety stock quantity defined:\n            Reorder point = [(average lead time days * demand) + safety stock quantity)\n    * Manually Calculate &#x2013; Clear the Auto-Calculate box to manually enter the point at which to reorder or build more of this item.\n\nIf you go to Home > User Preferences and place a check mark in the Inventory Level Warnings box, NetSuite reminds you when you have reached the reorder point."
    },
    {
      "id": "availabletopartners",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Available to Adv. Partners",
      "required": false,
      "help": "Check this box to make this item available to partners with the Advanced Partner Center role for viewing.\n\nThese items are also available to partners with roles that are customized for the Advanced Partner Center and include view, create or edit access to item records."
    },
    {
      "id": "averagecost",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Average Cost",
      "required": false,
      "help": "This field displays the current average cost of the item across all locations. Using the weighted-average method, the average cost is calculated as the total units available during a period divided by the beginning inventory cost plus the cost of additions to inventory.\nNote: The average cost calculated per location is listed for each location on the Locations subtab.\nIf you use Multiple Units of Measure, average cost is calculated using stock units."
    },
    {
      "id": "billexchratevarianceacct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Exchange Rate Variance Account",
      "required": false,
      "help": "Select the account to post to for variances in exchange rates associated with this item. These variances occur when there are exchange rate differences between the receipt and the bill for an item.\n\nNote: After you select a variance account in this field, you can select another account at a later date if a change is necessary. Account changes are noted on the System Notes subtab of the History subtab of item records."
    },
    {
      "id": "billingschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Billing Schedule",
      "required": false,
      "help": "Choose the billing schedule you want to associate with this item.\n\nWhen an item is associated with a billing schedule, the billing schedule appears by default when the item is added to an order.\n \nNote: Forms must be customized to show schedules on lines. Read Applying Billing Schedules. \n\nClick New to enter a new billing schedule."
    },
    {
      "id": "billpricevarianceacct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Price Variance Account",
      "required": false,
      "help": "Select the account to post to for variances in billing prices associated with this item. These variances occur when there is a difference in the price of an item showing on the purchase order and the price of an item showing on the bill.\n\nNote: After you select a variance account in this field, you can select another account at a later date if a change is necessary. Account changes are noted on the System Notes subtab of the History subtab of item records."
    },
    {
      "id": "billqtyvarianceacct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Quantity Variance Account",
      "required": false,
      "help": "Select the account to post to for variances in billing quantities associated with this item. These variances occur when there is a difference in the quantity of an item showing on the receipt and the quantity of an item showing on the bill.\n\nNote: After you select a variance account in this field, you can select another account at a later date if a change is necessary. Account changes are noted on the System Notes subtab of the History subtab of item records."
    },
    {
      "id": "buyitnowprice",
      "type": "currency",
      "nlapiSubmitField": true,
      "label": "Buy It Now Price",
      "required": false,
      "help": ""
    },
    {
      "id": "class",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Class",
      "required": false,
      "help": "Select a class to associate with this item.\n\nClick New to enter a new class record.\n\nGo to <_TABNAME=LIST_CLASS_> > <_TASKCATEGORY=LIST_CLASS_> > Classes for details about existing class records."
    },
    {
      "id": "cogsaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "COGS Account",
      "required": false,
      "help": "Select the Cost of Goods Sold account that tracks the cost of this item. Click &#x2014;New&#x2014; to set up a new account.\n\nGo to Lists > Accounts for details about existing accounts."
    },
    {
      "id": "conditionenabled",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "conditionhelpurl",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "contingentrevenuehandling",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Eligible For Contingent Revenue Handling",
      "required": false,
      "help": "Check this box to indicate that the item is subject to contingent revenue handling. When checked, revenue allocation is affected."
    },
    {
      "id": "copydescription",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Copy from Sales Order",
      "required": false,
      "help": "Check this box to copy the purchase description from the item description you enter on a sales order.\n\nClear this box to enter a purchase description in the field above."
    },
    {
      "id": "cost",
      "type": "currency2",
      "nlapiSubmitField": false,
      "label": "Purchase Price",
      "required": false,
      "help": "Enter the price you pay for this item.\n\nIf you do not enter a price, purchase orders for this item show the most recent purchase price by default.\n\nIf you select a preferred vendor for this item, the price is shown in the currency selected on the vendor's record. If no preferred vendor is selected, the price is shown in your base currency."
    },
    {
      "id": "costcategory",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Cost Category",
      "required": true,
      "help": "Select a cost category to associate with this item. View existing cost categories at <_TABNAME=LIST_ACCOUNTINGOTHERLIST_> > <_TASKCATEGORY= LIST_ACCOUNTINGOTHERLIST_> > Accounting Lists > Cost Category. For more details, click Help and read Creating Cost Categories."
    },
    {
      "id": "costestimate",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Item Defined Cost",
      "required": false,
      "help": "Enter an Item Defined Cost amount."
    },
    {
      "id": "costestimatetype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Cost Estimate Type",
      "required": false,
      "help": "The Cost Estimate Type determines what value NetSuite uses to calculate estimated Gross Profit.\n\nThe estimated Gross Profit for Items on a transaction provides the data needed to calculate the total estimated Gross Profit on that transaction.\n\nThe individual line items that you enter in a transaction determine the amounts that post when you process that transaction.\n\nThe following Cost Estimate Types on Items are available:\n\n    * Item Defined Cost - a user-defined amount, entered into the Item Defined Cost field on the Item definition page.\n    * Average Cost - NetSuite calculates an average cost of the units purchased. \n    * Last Purchase Price - This field displays the most recent purchase price of the item as determined by purchase order receipt transactions. \n    * Purchase Price - Price entered that you pay for this item. If you do not enter a price, then the most recent purchase price from purchase orders provides the price for this item by default.\n    * Preferred Vendor Rate - This option is only used if the Multi-Vendor feature is enabled and multiple vendors supply the same item.\n          o First priority is to use the preferred vendor rate if defined on the Item record.\n          o Next priority would be to use the purchase price.\n          o Last priority would be the purchase order rate. (Initially this uses the preferred vendor rate cost, and then after a purchase order is entered, this type uses the most recent actual purchase order rate. Special orders and drop-shipped items use this cost information.)\n    * Derived from member items - Total costs of items currently included in a kit. This Cost Estimate Type only applies to kits and sums the estimated costs of each item in the kit, based on each of their individual Cost Estimate Types. Uses the latest definition of the kit, not its historical definition."
    },
    {
      "id": "costingmethod",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Costing Method",
      "required": false,
      "help": "Select your inventory costing method.\n\nThe costing method you choose determines how Cost of Goods Sold (COGS) calculations are handled for costs associated with buying the same item at different purchase prices over a given period.\n\nCosting methods include the following:\n\n    * Average (weighted-average method) &#x2013; COGS are calculated as the total units available during a period divided by the beginning inventory cost plus the cost of additions to inventory. \n    * Group Average &#x2013; Group average costing enables you to track one average cost for an item across multiple locations within a defined group. For details, click Help and read Group Average Costing.\n    * First-In, First-Out (FIFO) &#x2013; Using FIFO, the first goods purchased are assumed to be the first goods sold so that the ending inventory consists of the most recently purchased goods. This method is useful to track different shipments of similar products.\n    * Last-In, First-Out (LIFO) &#x2013; Using LIFO, the last goods purchased are assumed to be the first goods sold so that the ending inventory consists of the first goods purchased. \n    * Standard &#x2013; Standard Costing enables you track standard costs for items and to track variances between these expected costs and actual costs.\n\nIn NetSuite, Average costing is the default costing method.\n\nNote: Once the costing method is saved on the item record, it cannot later be changed."
    },
    {
      "id": "costingmethoddisplay",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Costing Method",
      "required": false,
      "help": "The costing method is displayed here.\n\nA costing method determines how to handle costs associated with buying the same item at different purchase prices over a given period.\n\nThe costing method for serialized items is always Serialized. Serialized costing associates the purchase price of each item individually.\n\nThe costing method for lot numbered items is always Lot Numbered. Lot numbered costing associates the purchase price of the lot of items."
    },
    {
      "id": "costunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "countryofmanufacture",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Manufacturer Country",
      "required": false,
      "help": "Enter the name of the country where this item is manufactured.\n\nThis information is used for customs purposes when shipping."
    },
    {
      "id": "createddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Date Created",
      "required": false,
      "help": ""
    },
    {
      "id": "createrevenueplanson",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Create Revenue Plans On",
      "required": false,
      "help": "Select the event that triggers creation of revenue recognition plans. Match the event with the amount source of the item's revenue recognition rule.\n\n    * Revenue Arrangement Creation - Revenue plans can be created when the revenue arrangement is created. Use this option with rules that have Event-Amount as the Amount Source.\n    * Billing - Revenue plans can be created when the sales order is billed and from stand-alone cash sales, invoices, credit memos, and cash refunds. Use this option with rules that have Event-Percent based on amount as the Amount Source.\n    * Fulfillment - This option is available only when Advanced Shipping is enabled. Revenue plans can be created upon fulfillment. Use this option with rules that have Event-Percent based on quantity as the Amount Source.\n    * Project Progress - This option is available only when the Projects feature is enabled. Use this option with rules that have Event-Percent Complete as the Amount Source."
    },
    {
      "id": "currency",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Currency",
      "required": false,
      "help": "The purchase price for this item is listed in this currency.\n\nThe currency selected on the preferred vendor record is shown in this field.\n\nIf there is no preferred vendor selected, your base currency is shown."
    },
    {
      "id": "customform",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Custom Form",
      "required": false,
      "help": "Select the form you want to use to enter this record.\n\nYou can select the standard form, a custom form you have already created, or select New to create a custom form."
    },
    {
      "id": "custreturnvarianceaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Customer Return Variance Account",
      "required": false,
      "help": ""
    },
    {
      "id": "deferredrevenueaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Deferred Revenue Account",
      "required": false,
      "help": "Select the deferred revenue account to associate with this item. If you use revenue recognition or advanced revenue management, the revenue from the sale of this item is deferred."
    },
    {
      "id": "deferrevrec",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Hold Revenue Recognition",
      "required": false,
      "help": "Check this box to delay recognizing revenue from the sale of this item. When this box is check, revenue recognition schedules or revenue plans are created with the status On Hold.\n\nFor more information, see the help topic Delaying Revenue Recognition for an Item."
    },
    {
      "id": "demandmodifier",
      "type": "percent",
      "nlapiSubmitField": true,
      "label": "Expected Demand Change",
      "required": false,
      "help": "Enter the default percentage of  Expected Demand Change to use for calculating item demand.\n\nFor example, if you know that new customers will increase sales of this item in the future, you can enter a 10% expected demand change to be added on to previous sales totals.\n\nIf no expected demand change percentage is entered, then the default value from the Set Up Inventory Management page is used."
    },
    {
      "id": "demandtimefence",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Demand Time Fence",
      "required": false,
      "help": "Demand Time Fence defaults to the number entered in the Default Demand Time Fence field.\nVerify the default or enter a number between zero and 365 to determine the demand time fence for this item."
    },
    {
      "id": "department",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Department",
      "required": false,
      "help": "Choose a department to associate with this item.\n\nClick New to enter a new department record.\n\nGo to <_TABNAME=LIST_DEPARTMENT_> > <_TASKCATEGORY=LIST_DEPARTMENT_> > Departments for details about existing department records."
    },
    {
      "id": "directrevenueposting",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Direct Revenue Posting",
      "required": false,
      "help": "Check this box to disable advanced revenue management for this item. When checked, posting transactions that include this item post directly to the item revenue account. No revenue element or revenue arrangement is created. When you check this box, the Deferred Revenue Account on the Accounting subtab is disabled.\n\nWhen you create sales transactions that include items that have this box checked, all the items in the transaction must have the box checked. You cannot mix items that post directly to revenue with items that post to deferred revenue in the same transaction. This restriction also applies to kit items. All items in a kit must post either to revenue or to deferred revenue.\n\nYou cannot check or clear the box after the item has been used in a transaction with advanced revenue management.\n\nBy default, this box is not checked."
    },
    {
      "id": "displayinebaystore",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "eBay Store",
      "required": false,
      "help": ""
    },
    {
      "id": "displayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Display Name/Code",
      "required": false,
      "help": "You can enter an optional name for this item in addition to the Item Name. If you are integrating with a Yahoo! store, this field is imported from Yahoo!.\n\nThe display name prints in the Item column of sales forms. If this item is a member of a kit, this name appears in the Item column when the Print Items box is checked.\n\nIf you do not enter a display name, the item name appears on printed forms."
    },
    {
      "id": "distributioncategory",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Distribution Category",
      "required": false,
      "help": "Choose the appropriate category. Once a distribution category is defined on the item record, NetSuite can incorporate network transfers into demand planning for the item.\n\nNote: The network and category you select must be associated with the subsidiary selected for the item in the Classifications section of the item record. For details about how categories are associated with subsidiaries, click Help and read Creating Distribution Categories."
    },
    {
      "id": "distributionnetwork",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Distribution Network",
      "required": false,
      "help": "Choose the appropriate network to determine the distribution categories available to you. If the distribution network field is blank, then distribution category must also be blank.\n\nNote: The network and category you select must be associated with the subsidiary selected for the item in the Classifications section of the item record. For details about how networks are associated with subsidiaries, click Help and read Creating a Distribution Network."
    },
    {
      "id": "dontshowprice",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Don't Show Price",
      "required": false,
      "help": "Check this box to hide the price of this item online.\n\nThis is useful for items you want to advertise but don't want to sell or for items that you track inventory for and want to display but are offered in combination with other items."
    },
    {
      "id": "dropshipexpenseaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Dropship Expense Account",
      "required": false,
      "help": "When the Automated Intercompany Drop Ship feature is enabled, this field defaults to the account specified in the Default Expense Account on Accounting Preference page, but you can override this account. The account you select must have the Eliminate Intercompany Transactions box checked."
    },
    {
      "id": "ebayhandlingtime",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Handling Time",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlinsurancefee",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Insurance Amount",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlpackagehandlingfee",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Package & Handling Fee",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlshipinsurance",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Insurance",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlshippingitem1",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 1",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlshippingitem2",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 2",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayintlshippingitem3",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 3",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayisintlcalculatedrate",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Flat Rates",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayisirregularpackage",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Irregular Package",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemdescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Item Description",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemlocdisplay",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Item Location",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemloczipcode",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Item Location Zip Code",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemlots",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Lot Size",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemsubtitle",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Subtitle",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemtitle",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Item Title",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayitemweightamt",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Item Weight",
      "required": false,
      "help": ""
    },
    {
      "id": "ebaylayout",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Default Chart Type",
      "required": false,
      "help": ""
    },
    {
      "id": "ebaypackagetype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Package",
      "required": false,
      "help": ""
    },
    {
      "id": "ebaypagecounter",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Page Counter",
      "required": false,
      "help": ""
    },
    {
      "id": "ebayrelistingoption",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Relisting Option",
      "required": false,
      "help": ""
    },
    {
      "id": "ebaytheme",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Theme",
      "required": false,
      "help": ""
    },
    {
      "id": "ebaythemegroup",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Theme Group",
      "required": false,
      "help": ""
    },
    {
      "id": "endauctionswhenoutofstock",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "End Auctions When Item is Out of Stock",
      "required": false,
      "help": ""
    },
    {
      "id": "enforceminqtyinternally",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Enforce Internally",
      "required": false,
      "help": "Check this box to apply the minimum quantity restriction on sales orders generated from NetSuite. When you clear this box, but enter a number in the Minimum Quantity field, the minimum quantity is only applied to web store orders."
    },
    {
      "id": "excludefromsitemap",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Exclude From Sitemap",
      "required": false,
      "help": "Check this box to exclude a tab, category or item page from the site map."
    },
    {
      "id": "externalid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "ExternalId",
      "required": false,
      "help": ""
    },
    {
      "id": "featureddescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Featured Description",
      "required": false,
      "help": "If this item is displayed on the home page of your Web site, enter a featured description for this item.\n\nThis description appears below the item's store display name on the Home page of your store or site.\n\nYou can enter up to 999 characters including basic HTML code.\n\nEnter and format text using the formatting options, or click the HTML Source Code link to enter HTML."
    },
    {
      "id": "fraudrisk",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Fraud Risk",
      "required": false,
      "help": "Choose the fraud risk level for this item.\n\nThis setting is used by the CyberSource Decision Manager when determining which transactions might be fraudulent."
    },
    {
      "id": "froogleproductfeed",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "gainlossaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Gain/Loss Account",
      "required": false,
      "help": "When the Use Item Cost as Transfer Cost preference is disabled, the transfer price on a transfer order is used as the item cost on the item receipt. Any difference between the actual cost and the transfer price posts to a Gain/Loss account when the item is shipped.\n\nIn this field, select the Gain/Loss account you prefer to use to post transfer cost discrepancies. The account you select must be different than the Asset or Cost of Goods Sold (COGS) account for the item.\n\nYou can choose an Income account, Other Income account, Expense account, or Other Expense account.\n \nNote: If you have enabled the Expand Account Lists preference, you can choose any account in this field.\nIf you leave this field blank or select Use Income Account, then the income account for the item is used."
    },
    {
      "id": "gallery",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Gallery",
      "required": false,
      "help": ""
    },
    {
      "id": "galleryfeatured",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Featured First",
      "required": false,
      "help": ""
    },
    {
      "id": "gifttypeexpressship",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Express shipping",
      "required": false,
      "help": ""
    },
    {
      "id": "gifttypegiftwrap",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Gift wrap / gift card",
      "required": false,
      "help": ""
    },
    {
      "id": "gifttypeshiptorecipient",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Ship to gift recipient",
      "required": false,
      "help": ""
    },
    {
      "id": "handlingcost",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Handling Cost",
      "required": false,
      "help": "As an option, you may enter a handling cost for this item in dollars.\n\nYou must also create a shipping item for per-item shipping and handling costs at Lists > Shipping Items > New.\n\nWhen this item is selected on sales orders, invoices or cash sales, the appropriate shipping and handling charges are automatically calculated."
    },
    {
      "id": "handlingcostunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "handlinggroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Handling",
      "required": false,
      "help": ""
    },
    {
      "id": "imagesgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Images",
      "required": false,
      "help": ""
    },
    {
      "id": "imageslocation",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Images Location",
      "required": false,
      "help": ""
    },
    {
      "id": "includechildren",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Include Children",
      "required": false,
      "help": "Check the Include Children box to share the item with all the sub-subsidiaries associated with each subsidiary selected in the Subsidiary field.\n\nNote: When sharing items across subsidiaries, all of the options selected on the item record must be compatible across subsidiaries.\n \nFor example, when entering an inventory item to be shared across subsidiaries, you should select Income and Asset accounts on the item record that are also shared across the same subsidiaries."
    },
    {
      "id": "incomeaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Income Account",
      "required": false,
      "help": "Select the income account to associate with this item. When no income account is selected, the item does not show in the Item dropdown list for sales transactions."
    },
    {
      "id": "intercocogsaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Intercompany COGS Account",
      "required": false,
      "help": ""
    },
    {
      "id": "intercodefrevaccount",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Intercompany Deferred Revenue Account",
      "required": false,
      "help": "Select the account to use for intercompany deferred revenue. This account is used to record transactions between subsidiaries in NetSuite OneWorld accounts. The options include only accounts with the Eliminate Intercompany Transactions box checked.\n\nFor more more information about intercompany transactions, see the help topic Understanding Automated Intercompany Management."
    },
    {
      "id": "intercoincomeaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Intercompany Income Account",
      "required": false,
      "help": ""
    },
    {
      "id": "internalid",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Internal ID",
      "required": false,
      "help": ""
    },
    {
      "id": "iscalculatedrate",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Flat Rates",
      "required": false,
      "help": ""
    },
    {
      "id": "isdonationitem",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Variable Amount",
      "required": false,
      "help": "Check this box to set this item as variable-priced. This enables customers to enter their own prices for this item, such as for donations."
    },
    {
      "id": "isdropshipitem",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Drop Ship Item",
      "required": false,
      "help": "Check the Drop Ship Item box to have this item default as a drop ship item on sales orders.\n\nWhen a sales transaction for a drop ship item is approved, a linked purchase order for the preferred vendor is automatically generated.\n\nThe vendor ships this item to your customer directly.\n\nNote: an item can be a drop ship or a special order, but not both."
    },
    {
      "id": "isgcocompliant",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Allow Google Checkout Purchase",
      "required": false,
      "help": "Check this box to make the item available for purchase with Google Checkout."
    },
    {
      "id": "isinactive",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Inactive",
      "required": false,
      "help": "When you check this box, this item will no longer appear on a list unless you check the Show All box at the bottom of the list page."
    },
    {
      "id": "isonline",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Display in Web Store",
      "required": false,
      "help": "Check this box to make this item available online in your Web site.\n\nYou cannot sell this item online unless you check this box."
    },
    {
      "id": "isspecialorderitem",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Special Order Item",
      "required": false,
      "help": "Check this box if you want this item to default as a special order on sales transactions.\n\nWhen a sales transaction for a special order item is approved, a linked purchase order is automatically generated. Then, the order cannot be fulfilled until the linked purchase order is received.\n\nSpecial order items can be used for custom orders or \"just-in-time\" inventory.\n\nImportant: You must identify a preferred vendor and a purchase price on an item record in order for that item to be selected as a special order.\n\nNote: An item can be a drop ship or a special order, but not both."
    },
    {
      "id": "isstorepickupallowed",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Store Pickup Allowed",
      "required": false,
      "help": "If this box is checked, indicates that at least one location allows store pickup of the item. If you clear the Allow Store Pickup box in the Locations sublist for all locations, this box is also cleared when you save the item record.\n\nThis field is read only."
    },
    {
      "id": "issueproduct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Product Name",
      "required": false,
      "help": "Select the product this item is associated with.\n\nProduct records are tracked with versions and builds for issue management.\n\nTo create product records, go to <_TABNAME=ADMI_ISSUEPRODUCT_> > <_TASKCATEGORY=ADMI_ISSUEPRODUCT_> > Products > New."
    },
    {
      "id": "itemcondition",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Condition",
      "required": false,
      "help": ""
    },
    {
      "id": "itemhandlingfee",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Package & Handling Fee",
      "required": false,
      "help": ""
    },
    {
      "id": "itemid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Item Name/Number",
      "required": true,
      "help": "Type up to 60 characters for the name of this item. This name appears in lists on transactions.\n\nIf you have the option of entering a display name and do not, the item name prints in the Item column of sales forms.\n\nIf you have the option to enter a vendor name and do not, the item name prints in the Item column of purchase forms. If you have entered a display name, it will print on purchases instead of the item name."
    },
    {
      "id": "iteminsurancefee",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Insurance Amount",
      "required": false,
      "help": ""
    },
    {
      "id": "itemoptions",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Options",
      "required": false,
      "help": ""
    },
    {
      "id": "itemrevenuecategory",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Revenue Category",
      "required": false,
      "help": "The item revenue category is a classification for items that have similar characteristics and revenue allocation requirements. It is used in the fair value price list."
    },
    {
      "id": "itemshipinsurance",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Insurance",
      "required": false,
      "help": ""
    },
    {
      "id": "itemtype",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "lastmodifieddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Last Modified",
      "required": false,
      "help": ""
    },
    {
      "id": "lastpurchaseprice",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Last Purchase Price",
      "required": false,
      "help": "This field displays the most recent purchase price of the item.\n\nThis price is determined by the most recent transaction for the item that added positive inventory, such as a purchase receipt, inventory transfer or inventory adjustment. (This does not include item returns or assembly unbuilds.)\n\nIf two transactions are entered on the same day, the one entered later takes precedence and is used to calculate the last purchase price.\n\nWhen you use the Multiple-Location Inventory feature, the following is true:\n    * The last purchase price reflects the most recent transaction at any location. \n    * The Inventory subtab of inventory item records includes a link to the last positive-inventory transaction per location.\n    * If multiple purchases are made on the same day with different prices and locations, then the highest price paid on that day becomes the last purchase price.\n\nIf you use Multiple Units of Measure, the last purchase price is calculated using purchase units."
    },
    {
      "id": "leadtime",
      "type": "integer",
      "nlapiSubmitField": true,
      "label": "Lead Time",
      "required": false,
      "help": "Lead time is the average number of days between ordering this item from the vendor and receiving it.\n    * Auto-Calculating &#x2013; Check the Auto-Calculate box if you want NetSuite to calculate the lead time based on the most recent order history of this item. Lead time is calculated by taking the number of days between the order entry and receipt on the three most recent purchase orders, and dividing by three. If more than three purchase orders exist, all purchase orders within the period specified in the Order Analysis Interval field on the Inventory Management Preferences dialog will be used.\n          o If there are multiple receipts for the item against the same purchase order, the calculation is made using the difference between the purchase order and the last receipt (the receipt that fully receives the order).\n          o Lead time calculation is not weighted by number of units received.\n          o More recent purchase orders without receipts are ignored.\n    * Manually Calculating &#x2013; Clear the Auto-Calculate box to manually enter a lead time value in days. If the Auto-Calculate box is cleared and no value is entered, then the default value from the Set Up Inventory Management page is used."
    },
    {
      "id": "listimmediate",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Start listing when submitted",
      "required": false,
      "help": ""
    },
    {
      "id": "listingduration",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Duration",
      "required": false,
      "help": ""
    },
    {
      "id": "listingstartdate",
      "type": "date",
      "nlapiSubmitField": false,
      "label": "Start Date",
      "required": false,
      "help": ""
    },
    {
      "id": "listingstarttime",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Start Time",
      "required": false,
      "help": ""
    },
    {
      "id": "location",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Location",
      "required": false,
      "help": "Select a location to associate with this item.\nTo use a location, the Multi-Location Inventory feature must be enabled.\n\n    * If the Multi-Location Inventory feature is not enabled:\n\n      Selecting an item record location limits the items that certain roles can access.\n      For example, Role A is set up to access only items associated with Location One. Therefore, employees who have Role A can access only items associated with Location One.\n\n      Note: If the Multi-Location Inventory feature is not enabled, you cannot use this field to track inventory by locations. For example, you cannot track how many widgets you have in stock in Location One.\n\n      For more information click here.\n\n    * If the Multi-Location Inventory feature is enabled:\n\n      Selecting an item record location classifies the item by that location to limit the items that certain roles can access. To track inventory per location, use the Locations subtab at the bottom of this form.\n\n      For more information click here.\n\nSelect New to enter a new location record.\n\nGo to <_TABNAME=LIST_LOCATION_> > <_TASKCATEGORY=LIST_LOCATION_> > Locations for details about existing location records."
    },
    {
      "id": "manufacturer",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Manufacturer",
      "required": false,
      "help": "Enter the name of the company that manufactures this item."
    },
    {
      "id": "manufactureraddr1",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer Address",
      "required": false,
      "help": "Enter the address of the manufacturer.\n\nThis is necessary to fill out international shipping forms when you sell and ship this item."
    },
    {
      "id": "manufacturercity",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer City",
      "required": false,
      "help": "Enter the city location of the manufacturer of this item.\n\nThis is necessary to automatically fill out international forms when you ship this item across borders."
    },
    {
      "id": "manufacturerstate",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer State",
      "required": false,
      "help": "Enter the state where this item's manufacturer is located.\n\nThis is necessary to fill out international forms when you ship this item."
    },
    {
      "id": "manufacturertariff",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer Tariff",
      "required": false,
      "help": "Enter the Harmonized System (HS) tariff code number or the Harmonized Tariff Schedule (HTS) code number.\n\nThis number should be six to ten characters."
    },
    {
      "id": "manufacturertaxid",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer Tax Id",
      "required": false,
      "help": "Enter the Tax ID Number (TIN) for the manufacturer."
    },
    {
      "id": "manufacturerzip",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Manufacturer Zip",
      "required": false,
      "help": "Enter the postal code of the location of this manufacturer.\n\nThis is necessary to create international forms when you ship this item."
    },
    {
      "id": "matchbilltoreceipt",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Match Bill To Receipt",
      "required": false,
      "help": "Check the Match Bill to Receipt box if you want the Match Bill to Receipt box on transaction lines to be checked by default for this item. This enables you to generate variances based on vendor bill lines.  Then, on the Post Vendor Bill Variances page, you must select Bill in the Transaction Type field to generate the variance postings.\n\nPurchase orders that include this item default to have this box checked and variances are generated based on vendor bill lines.\n\nClear this box if you want to generate variance postings based on purchase order lines rather than vendor bill lines and do not want the Match Bill to Receipt box to be checked by default on transaction lines for this item. Then, on the Post Vendor Bill Variances page, you must select Purchase Order in the Transaction Type field to generate the variance postings.\n\nThis preference defaults to be disabled. Even when enabled, this option can be changed on individual purchase order lines."
    },
    {
      "id": "matrixitemnametemplate",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Matrix Item Name Template",
      "required": false,
      "help": "This field is used to control how the matrix item will be displayed in the Matrix Item Name/Number field.\n\nCompose the order in which attributes and matrix options are displayed by selecting from the Insert Item Attribute and Insert Matrix Option dropdown lists.\n\nAdd custom separator characters to easier distinguish the various options. \n\nExample: Item Name: Fabric / Color / Waist / Length [Location]"
    },
    {
      "id": "matrixtype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Matrix Type",
      "required": false,
      "help": ""
    },
    {
      "id": "maxdonationamount",
      "type": "currency2",
      "nlapiSubmitField": false,
      "label": "Maximum Variable Amount",
      "required": false,
      "help": "If you checked the Variable Amount box, enter the maximum amount that can be paid or donated for this item."
    },
    {
      "id": "maximumquantity",
      "type": "posinteger",
      "nlapiSubmitField": true,
      "label": "Maximum Quantity",
      "required": false,
      "help": ""
    },
    {
      "id": "metataghtml",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Meta Tag HTML",
      "required": false,
      "help": "Enter the Meta Tag HTML you want to appear in the < head > section of this item page.\n\nMeta tags enable your Web site to be found by search engines."
    },
    {
      "id": "minimumquantity",
      "type": "posinteger",
      "nlapiSubmitField": true,
      "label": "Minimum Quantity",
      "required": false,
      "help": "Enter the lowest quantity that customers can purchase.  Web store customers receive a warning and cannot check out if they enter an item quantity below this minimum. \n\n Leave this field empty to allow customers to check out with no minimum quantity restrictions.\n\nYou can edit this warning at Setup > Site Builder/SuiteCommerce Advanced > Customize Text."
    },
    {
      "id": "minimumquantityunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "mossapplies",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "MOSS Applies",
      "required": false,
      "help": ""
    },
    {
      "id": "mpn",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "MPN",
      "required": false,
      "help": "MPN (Manufacturers Part Number) - Enter the part number used by the manufacturer to identify this item."
    },
    {
      "id": "multmanufactureaddr",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Multiple Manufacture Addresses",
      "required": false,
      "help": "Check the Multiple Manufacture Addresses box if this manufacturer uses more than one address."
    },
    {
      "id": "nextagcategory",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "NexTag Category",
      "required": false,
      "help": "Enter the name of the NexTag category this item should be included in.\n\nThis category is included in the product feeds you can export at Setup > Web Site > Product Feeds.\n\nGo to www.nextag.com for more information on the available categories.\n\nThis is an optional field only displayed for the following item records: Kit/Package, Non-inventory Item for Sale, Non-inventory Item for Resale, Assembly (lot and serialized), and Inventory (lot and serialized)."
    },
    {
      "id": "nextagproductfeed",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "nopricemessage",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "No Price Message",
      "required": false,
      "help": "If you opted to not show a price online, enter the message that should show instead of the price.\n\nFor example, you might enter \"Call for Price.\""
    },
    {
      "id": "numactivelistings",
      "type": "integer",
      "nlapiSubmitField": true,
      "label": "Active Listings",
      "required": false,
      "help": ""
    },
    {
      "id": "numcurrentlylisted",
      "type": "integer",
      "nlapiSubmitField": true,
      "label": "Quantity Currently Listed",
      "required": false,
      "help": ""
    },
    {
      "id": "offersupport",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Offer Support",
      "required": false,
      "help": "Check this box to offer support for this particular item.\n\nBy offering support for items, customers can select on case records which item they are having trouble with."
    },
    {
      "id": "outofstockbehavior",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Out Of Stock Behavior",
      "required": false,
      "help": "Select a custom out of stock behavior for this item. It overwrites the overall site&#x2019;s out of stock behavior. Your choices are:\n\n    * Default - Uses the behavior selected in the Web Store Out of Stock Items field at Setup > Web Site > Setup Tasks > Set Up Web Site > Shopping.\n    * Disallow back orders but display out of stock messages\n    * Allow back orders but display out of stock messages\n    * Remove items when out of stock\n    * Allow back orders with no out of stock message"
    },
    {
      "id": "outofstockmessage",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Out Of Stock Message",
      "required": false,
      "help": "You can enter a custom out of stock message for this item. The message here replaces the default out of stock message."
    },
    {
      "id": "overallquantitypricingtype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Calculate Quantity Discounts",
      "required": false,
      "help": "Choose how to determine the quantity for the purpose of pricing:\n    * By Line Quantity - pricing is applied according to the quantity included in the line item.\n    * By Overall Item Quantity - pricing is applied for all line items for the same item on a transaction.\n    * By Overall Parent Quantity - pricing is applied for all items with the same parent item on the transaction. This can be useful for applying quantity pricing to matrix items.\n    * By Overall Schedule Quantity - pricing is applied to all items that use the same pricing schedule that are included in the transaction."
    },
    {
      "id": "packageheight",
      "type": "posinteger",
      "nlapiSubmitField": false,
      "label": "Height",
      "required": false,
      "help": ""
    },
    {
      "id": "packagelength",
      "type": "posinteger",
      "nlapiSubmitField": false,
      "label": "Length",
      "required": false,
      "help": ""
    },
    {
      "id": "packagewidth",
      "type": "posinteger",
      "nlapiSubmitField": false,
      "label": "Width",
      "required": false,
      "help": ""
    },
    {
      "id": "pagetitle",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Page Title",
      "required": false,
      "help": "Enter the text you want to appear as the page's title for this item. This text appears in the browser tab. Use a descriptive title for the item page, this can help achieve better results with search engine ranking."
    },
    {
      "id": "parent",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subitem of",
      "required": false,
      "help": "If you want this item to be a subitem, select the parent item here."
    },
    {
      "id": "preferencecriterion",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Preference Criterion",
      "required": false,
      "help": "Set the NAFTA criterion for this item."
    },
    {
      "id": "preferredlocation",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Preferred Location",
      "required": false,
      "help": "Choose the location you want to associate with this item.\nThis location will automatically populate sales orders that display locations on a line-item basis.\n\nThis field is also used to calculate real-time shipping cost on web orders. If this item appears in your web site, select a Preferred Location.\n\nWhen the Automatic Location Assignment feature is enabled, and the sales order location is automatically populated, the automatic location assignment engine is prevented from assigning locations."
    },
    {
      "id": "preferredstockleveldays",
      "type": "float",
      "nlapiSubmitField": true,
      "label": "Days",
      "required": false,
      "help": "The preferred stock level is the optimum quantity to maintain in stock of an item.\n\nThe quantity you enter here is used to determine your replenishment needs on the Order Items page. It is the quantity you want to have in stock after an order is placed.\n\n    * Auto-Calculating &#x2013; Check the Auto-Calculate box if you want NetSuite to calculate the preferred stock level based on demand for the item.\n\n      The preferred stock level is calculated as:\n      (daily demand * number of days supply preferred).\n\n      If no preferred stock level is identified, then the default preferred stock level is used from the Set Up Inventory Management page.\n\n    * Manually Calculating &#x2013; Clear the Auto-Calculate box to manually enter the preferred stock quantity.\n\nThe preferred stock level you set is used to calculate the quantity of items to be ordered on the Order Items page."
    },
    {
      "id": "pricinggroup",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Pricing Group",
      "required": false,
      "help": "Select the pricing group this item is a member of.\n\nUsing pricing groups allows you to assign customer-specific price levels for a group of items.\n\nYou can create new pricing groups at <_TABNAME=EDIT_OTHERLIST_> > <_TABNAME=EDIT_OTHERLIST_> > Accounting Lists > New > Pricing Group."
    },
    {
      "id": "primarycatdisplayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "primarycategory",
      "type": "integer",
      "nlapiSubmitField": true,
      "label": "Primary Category",
      "required": false,
      "help": ""
    },
    {
      "id": "producer",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Producer",
      "required": false,
      "help": "Check this box if you produce this item for the purposes of the NAFTA Certificate of Origin."
    },
    {
      "id": "productfeed",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Product Feed",
      "required": false,
      "help": ""
    },
    {
      "id": "purchasedescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Purchase Description",
      "required": false,
      "help": "Enter up to 999 characters of text for a description of this item to appear on vendor orders. Include the unit of measure in this description."
    },
    {
      "id": "purchaseorderamount",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Purchase Order Amount Tolerance",
      "required": false,
      "help": "Enter the tolerance limit for the discrepancy between the amount on the vendor bill and purchase order."
    },
    {
      "id": "purchaseorderquantity",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Purchase Order Quantity Tolerance",
      "required": false,
      "help": "Enter the tolerance limit for the discrepancy between the quantity on the vendor bill and purchase order."
    },
    {
      "id": "purchaseorderquantitydiff",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Purchase Order Quantity Difference",
      "required": false,
      "help": "Enter the difference limit for the discrepancy between the quantity on the vendor bill and purchase order."
    },
    {
      "id": "purchasepricevarianceacct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Purchase Price Variance Account",
      "required": false,
      "help": "In the Purchase Price Variance Account field, choose the account to post a variance to when a purchase transaction calculates a cost variance."
    },
    {
      "id": "purchaseunit",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Purchase Units",
      "required": false,
      "help": "Select the unit you use to purchase this item from the vendor."
    },
    {
      "id": "quantitypricingschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Quantity Pricing Schedule",
      "required": false,
      "help": "Select the pricing schedule you want to use to set prices for this item.\n\nYou can create new pricing schedules at <_TABNAME=EDIT_QUANTITYPRICINGSCHEDULE_> > <_TASKCATEGORY=EDIT_QUANTITYPRICINGSCHEDULE_> > Quantity Pricing Schedules > New.\n\nSelecting a pricing schedule sets the Use Marginal Rates and Calculate Quantity Discounts fields."
    },
    {
      "id": "quantityreorderunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "receiptamount",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Item Receipt Amount Tolerance",
      "required": false,
      "help": "Enter the tolerance limit for the discrepancy between the amount on the vendor bill and item receipt."
    },
    {
      "id": "receiptquantity",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Item Receipt Quantity Tolerance",
      "required": false,
      "help": "Enter the tolerance limit for the discrepancy between the quantity on the vendor bill and item receipt."
    },
    {
      "id": "receiptquantitydiff",
      "type": "posfloat",
      "nlapiSubmitField": false,
      "label": "Vendor Bill - Item Receipt Quantity Difference",
      "required": false,
      "help": "Enter the difference limit for the discrepancy between the quantity on the vendor bill and item receipt."
    },
    {
      "id": "refundgivenas",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Refund will be given as",
      "required": false,
      "help": ""
    },
    {
      "id": "relateditemsdescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Related Items Description",
      "required": false,
      "help": "Enter a description for the related items you show with this item in your Web site.\n\nYou can enter up to 999 characters of letters, numbers and basic HTML code.\n\nYou can also clear the View as HTML box below to enter and format text using the formatting options above.  This eliminates the need for HTML code."
    },
    {
      "id": "reordermultiple",
      "type": "posinteger",
      "nlapiSubmitField": false,
      "label": "Reorder Multiple",
      "required": false,
      "help": "Enter the quantity you prefer to order of this item each time. Then, the Order Items page suggests ordering a quantity of this item that is always multiple of the number you enter.\n\nFor example, if the vendor only accepts orders in multiples of one thousand, you would enter 1000 in this field. Then, the Order items page might suggest that you order 1000 or 2000, but not 1500.\n\nNote: If you use the Multiple Units of Measure feature, the reorder multiple always functions in base units."
    },
    {
      "id": "rescheduleindays",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Reschedule In Days",
      "required": false,
      "help": "In the Reschedule In Days field, enter a number between one and 90 that is the maximum number of days that the order can be advanced from the current day. For example, if you enter 10 in this field, an order for this item can be moved up ten days earlier, but not eleven or more days. This field defaults to be blank.\nNote: If this field is left blank, NetSuite does not make recommendations to reschedule orders for this item to a later date."
    },
    {
      "id": "rescheduleoutdays",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Reschedule Out Days",
      "required": false,
      "help": "In the Reschedule Out Days field, enter a number between one and 180 that is the maximum number of days that the order can be delayed from the current day. For example, if you enter 10 in this field, an order for this item can be moved to ten days later, but not eleven or more days. This field defaults to be blank.\nNote: If this field is left blank, NetSuite does not make recommendations to reschedule orders for this item to a later date."
    },
    {
      "id": "reserveprice",
      "type": "currency",
      "nlapiSubmitField": true,
      "label": "Reserve Price",
      "required": false,
      "help": ""
    },
    {
      "id": "returnpolicy",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Return Policy",
      "required": false,
      "help": ""
    },
    {
      "id": "returnpolicydetails",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Details",
      "required": false,
      "help": ""
    },
    {
      "id": "returnshippingpaidby",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Return Shipping will be paid by",
      "required": false,
      "help": ""
    },
    {
      "id": "returnswithin",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item must be returned within",
      "required": false,
      "help": ""
    },
    {
      "id": "revenueallocationgroup",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Revenue Allocation Group",
      "required": false,
      "help": "Select a revenue allocation group to use in GroupSum functions in fair value formulas. The value you select here is the default. You can change it on the revenue element."
    },
    {
      "id": "revenuerecognitionrule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Revenue Recognition Rule",
      "required": false,
      "help": "Select the revenue rule to use by default for this item in a revenue arrangement.\n\nBe sure the rule you select has an Amount Source that is appropriate for the value you select in the Create Revenue Plans On field. For more information, see the field level help for Create Revenue Plans On."
    },
    {
      "id": "revrecforecastrule",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Rev Rec Forecast Rule",
      "required": true,
      "help": "Select a revenue rule to use for forecast revenue recognition plans. The default is determined by the same accounting preference as the Revenue Recognition Rule.\n\nYou may select the same rule or a different rule for actual and forecast rules. Percent complete rules are not available as forecast rules. For information about forecast revenue plans for project progress, see Working with Percent-Complete Revenue Recognition Plans."
    },
    {
      "id": "revreclassfxaccount",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Foreign Currency Adjustment Account",
      "required": false,
      "help": "Select the account to use for the foreign currency adjustment during reclassification.\n\nYou can select any account with an account type of income, other income, expense, or other expense, including the gain and loss accounts generated by the system after qualifying revaluation transactions. You can change the Foreign Currency Adjustment Account on the revenue element before revenue recognition plans are created."
    },
    {
      "id": "revrecschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Revenue Recognition Template",
      "required": false,
      "help": "Select a default revenue recognition template to associate with this item on sales transactions.\n\nYou must also select a Deferred Revenue Account in order to use revenue recognition."
    },
    {
      "id": "safetystocklevel",
      "type": "float",
      "nlapiSubmitField": false,
      "label": "Safety Stock Level",
      "required": false,
      "help": "Enter the amount of an item you prefer to keep in stock at all times. Safety stock can be a quantity or a number of days worth of stock.\n \nThis amount is used to auto-calculate the reorder point of an item.\n    * To define safety stock as a quantity, enter a value.\n    * To define safety stock as a number of days, enter a value in the field next to Days.\n\nIf no safety stock value is entered, then the default value from the Set Up Inventory Management page is used."
    },
    {
      "id": "safetystockleveldays",
      "type": "integer",
      "nlapiSubmitField": true,
      "label": "Days",
      "required": false,
      "help": "Enter the amount of an item you prefer to keep in stock at all times. Safety stock can be a quantity or a number of days worth of stock.\n \nThis amount is used to auto-calculate the reorder point of an item.\n    * To define safety stock as a quantity, enter a value.\n    * To define safety stock as a number of days, enter a value in the field next to Days.\n\nIf no safety stock value is entered, then the default value from the Set Up Inventory Management page is used."
    },
    {
      "id": "safetystocklevelunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "salesdescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Sales Description",
      "required": false,
      "help": "Enter a sales description for this item.\n\nYou can enter letters and numbers. There is a 999 character limit.\n\nThe sales description displays on transactions such as sales orders, cash sales and invoices.\n\nIf you use the Web Store feature, the sales description displays immediately under the item's store display name on item list pages in your store or site, if you have not entered a store description for an item. Enter the store description on the Store subtab of the item record.\n\nThe sales description also displays by default when the item is in the Web store shopping cart."
    },
    {
      "id": "saleunit",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Sale Units",
      "required": false,
      "help": "Select the unit you use to sell this item to customers on sales transactions."
    },
    {
      "id": "schedulebcode",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Schedule B Code",
      "required": false,
      "help": "Select the unit of measure used to express the quantity entered in the Schedule B Quantity field. These two fields are used together to determine the amount represented by one of this item on the Schedule B form for Shipping Export Declarations.\n\nFor example, if you enter 5 in the Schedule B Quantity field, and you select kilogram in the Schedule B Code field, when you fulfill two of these items on an order, the Schedule B form presents the item's amount as 10 kilograms.\n\nSchedule B is the form for Statistical Classification of Domestic and Foreign Commodities Exported from the U.S. See www.census.gov/foreign-trade for more information."
    },
    {
      "id": "schedulebnumber",
      "type": "text",
      "nlapiSubmitField": true,
      "label": "Schedule B Number",
      "required": false,
      "help": "Enter the number for the Schedule B form for this item."
    },
    {
      "id": "schedulebquantity",
      "type": "posinteger",
      "nlapiSubmitField": true,
      "label": "Schedule B Quantity",
      "required": false,
      "help": "Enter the numeric quantity in relation to the unit of measure entered in the Schedule B Code field. These two fields are used together to determine the amount represented by one of this item on the Schedule B form for Shipping Export Declarations.\n\nFor example, if you enter 5 in the Schedule B Quantity field, and you select kilogram in the Schedule B Code field, when you fulfill two of these items on an order, the Schedule B form presents the items&#x2019; amount as 10 kilograms."
    },
    {
      "id": "searchkeywords",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Search Keywords",
      "required": false,
      "help": "Enter alternative search keywords that customers might use to find this item using your Web store&#x2019;s internal search.\n\nThese can include synonyms, acronyms, alternate languages or misspellings.\n\nThese keywords are seen as equally important as the item name when searches are conducted."
    },
    {
      "id": "seasonaldemand",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Seasonal Demand",
      "required": false,
      "help": "Check the Seasonal Demand box to define how NetSuite analyzes customer demand for this item\n\n.\n\nCustomer demand for an item is used to auto-calculate reorder points and preferred stock levels. An item&#x2019;s demand rate is calculated as the average sales quantity per day.\n\n    * Historical Demand &#x2013; Clear the Seasonal Demand box to calculate the demand as average sales per day over a specific period.\n      To set the number of months interval between analysis to evaluate sales orders and calculate item demand, go to Setup > Accounting > Set Up Inventory Management > Order Analysis Interval field.\n    * Seasonal Demand &#x2013; Check the Seasonal Demand box to calculate the reorder quantity for this item based on inventory demand changes through the year.\n      To set the number of months interval between analysis to evaluate sales orders and calculate item demand, go to Setup > Accounting > Set Up Inventory Management > Order Analysis Interval field."
    },
    {
      "id": "secondarycatdisplayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "secondarycategory",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Secondary Category",
      "required": false,
      "help": ""
    },
    {
      "id": "sellonebay",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Sell on eBay",
      "required": false,
      "help": ""
    },
    {
      "id": "shipasia",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Asia",
      "required": false,
      "help": ""
    },
    {
      "id": "shipaustralia",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Australia",
      "required": false,
      "help": ""
    },
    {
      "id": "shipcanada",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Canada",
      "required": false,
      "help": ""
    },
    {
      "id": "shipeurope",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Europe",
      "required": false,
      "help": ""
    },
    {
      "id": "shipgermany",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Germany",
      "required": false,
      "help": ""
    },
    {
      "id": "shipindividually",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Ships Individually",
      "required": false,
      "help": "Check this box if this item always ships alone and with no other items in the same package.\n\nThis helps determine the number of packages needed and the shipping rate on order fulfillments."
    },
    {
      "id": "shipjapan",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Japan",
      "required": false,
      "help": ""
    },
    {
      "id": "shipmexico",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Mexico",
      "required": false,
      "help": ""
    },
    {
      "id": "shipnorthsouthamerica",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "North and South America",
      "required": false,
      "help": ""
    },
    {
      "id": "shippackage",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Package",
      "required": false,
      "help": "Select the type of package this item normally ships in. The information for this package type automatically fills in on order fulfillments for this item.\n\nSetting up and assigning package types helps determine the number of packages on an order and helps return accurate real-time shipping rates.\n\nCreate package types at Setup > Accounting > Shipping > Packages subtab."
    },
    {
      "id": "shippingcost",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Shipping Cost",
      "required": false,
      "help": "As an option, you may enter a shipping cost for this item in dollars.\n\nYou must also create a shipping item for per-item shipping costs at Lists > Shipping Items > New.\n\nWhen this item is selected on sales orders, invoices or cash sales, the appropriate shipping charges are automatically calculated."
    },
    {
      "id": "shippingcostunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingdomesticmethodsgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Shipping Methods",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingdomgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Domestic Shipping Settings",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingintlgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "International Shipping Settings",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingintlgroup1",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Shipping Method 1",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingintlgroup2",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Shipping Method 2",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingintlgroup3",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Shipping Method 3",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingitem1",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 1",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingitem2",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 2",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingitem3",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Shipping Item 3",
      "required": false,
      "help": ""
    },
    {
      "id": "shippinglocationsgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Ship-to Locations",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingpackaginggroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Packaging",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingrate1",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Rate",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingrate2",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Rate",
      "required": false,
      "help": ""
    },
    {
      "id": "shippingrate3",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Rate",
      "required": false,
      "help": ""
    },
    {
      "id": "shipuk",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "United Kingdom",
      "required": false,
      "help": ""
    },
    {
      "id": "shipworldwide",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Worldwide",
      "required": false,
      "help": ""
    },
    {
      "id": "shoppingdotcomcategory",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Shopping.com Category",
      "required": false,
      "help": "Enter the name of the Shopping.com category that this item should go under.\n\nThis category is included in the product feeds that you can export from Setup > Web Site > Product Feeds.\n\nGo to www.shopping.com for more information on the categories available.\n\nThis is an optional field only available for following item records: Kit/Package, Non-inventory Item for Sale, Non-inventory Item for Resale, Assembly (lot and serialized), and Inventory (lot and serialized)."
    },
    {
      "id": "shoppingproductfeed",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "shopzillacategoryid",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Shopzilla Category ID",
      "required": false,
      "help": "Enter the name of the Shopzilla category this item should be included in.\n\nThis category is included in the product feeds you export at Setup > Web Site > Product Feeds.\n\nGo to www.shopzilla.com for more information on the available categories.\n\nThis is an optional field only displayed for the following item records: Kit/Package, Non-inventory Item for Sale, Non-inventory Item for Resale, Assembly (lot and serialized), and Inventory (lot and serialized)."
    },
    {
      "id": "shopzillaproductfeed",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "showasgift",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Show as Gift",
      "required": false,
      "help": ""
    },
    {
      "id": "showdefaultdonationamount",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Show Default Amount",
      "required": false,
      "help": "Check this box to suggest the item's online price for the item.\n\nWhen customers navigate to a donation item, they first see the online price for the item and then can choose to enter any amount they like."
    },
    {
      "id": "sitemappriority",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Sitemap Priority",
      "required": false,
      "help": "Use the Sitemap Priority list to indicate the relative importance of your Web site URLs.\n\nYou can select a priority ranging from 0.0 to 1.0 on item, category, and tab records.\n\nNetSuite assigns the default priority &#x201c;Auto&#x201d; to all new and existing tab, category and item records in your account. The priority is calculated based on the position of the item or category in the hierarchy of your Web site.\n\nFor example, your Web site tabs automatically generate a default priority value of 1.0 because they are top level pages. A category published to a tab gets a priority of 0.5. An item published to a category on a tab gets a priority of 0.3."
    },
    {
      "id": "softdescriptor",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Soft Descriptor",
      "required": false,
      "help": "In the Soft Descriptor list, select the name that will appear on the customer's credit card statement when this item is purchased.\n\nEnter soft descriptors to select in this field at Setup > Accounting > Payment Processing > Credit Card Soft Descriptors."
    },
    {
      "id": "standardimages",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Standard",
      "required": false,
      "help": ""
    },
    {
      "id": "startingprice",
      "type": "currency",
      "nlapiSubmitField": true,
      "label": "Starting Price",
      "required": false,
      "help": ""
    },
    {
      "id": "stockdescription",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Stock Description",
      "required": false,
      "help": "Enter up to 21 characters to specify information about this item, such as New, Refurbished or Ships 2-3 days."
    },
    {
      "id": "stockunit",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Stock Units",
      "required": false,
      "help": "Select the unit you use to stock this item in inventory."
    },
    {
      "id": "storecatdisplayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "storecatdisplayname2",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "storecategory",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Store Category",
      "required": false,
      "help": ""
    },
    {
      "id": "storecategory2",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Secondary Store Category",
      "required": false,
      "help": ""
    },
    {
      "id": "storedescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Web Store Description",
      "required": false,
      "help": "The store description appears under the item's store display name on item list pages in your store or site.\n\nYou can enter letters, numbers, and basic HTML code.\n\nNote: To make the store description display when an item is in the Web store shopping cart, go to Setup > Web Site > Set Up Web Site. Click the Cart subtab, and check the box next to Store Description."
    },
    {
      "id": "storedetaileddescription",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Detailed Description",
      "required": false,
      "help": "Enter a detailed description for this item.\n\nWhen your customers click an item's store display name for more information, they see this description.\n\nYou can enter letters, numbers or basic HTML code.\n\nIf you are using Internet Explorer, you can also clear the View Source box below to enter and format text using the formatting options above.  This eliminates the need for HTML code.\n\nIf you do not see the View Source box, make sure Rich Text Editing is enabled at Home > Set Preferences > Appearance."
    },
    {
      "id": "storedisplayimage",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Display Image",
      "required": false,
      "help": "Select an image from your file cabinet to display with this item in your Web site.\n\nUpload images at Lists > Web Site > Images.\n\nYou can automatically resize images less than 5 megapixels in size at Setup > Web Site > Image Resizing."
    },
    {
      "id": "storedisplayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Web Store Display Name",
      "required": false,
      "help": "Enter the name of this item as you want it displayed in your Web site."
    },
    {
      "id": "storedisplaythumbnail",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Display Thumbnail",
      "required": false,
      "help": "Select an image from your file cabinet you want to use as the thumbnail image for this item.\n\nThis image shows with this item before a customer clicks the item for more information.\n\nUpload images at Lists > Web Site > Images.\n\nYou can automatically resize images less than 5 megapixels in size at Setup > Web Site > Image Resizing."
    },
    {
      "id": "storeitemtemplate",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Item Drilldown Template",
      "required": false,
      "help": "If you have created an item template to display this item in your Web site, select the template here.\n\nCreate item templates at Lists > Item Templates.\n\nYou can set an item template for all your items at Setup > Site Templates > Body."
    },
    {
      "id": "subsidiary",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subsidiary",
      "required": false,
      "help": ""
    },
    {
      "id": "supersizeimages",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Supersize Pictures",
      "required": false,
      "help": ""
    },
    {
      "id": "supplyreplenishmentmethod",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Replenishment Method",
      "required": false,
      "help": "Select one of the following Replenishment Methods to calculate item replenishment requirements:\n\n    * Reorder Point &#x2013; To use Advanced Inventory Management settings for demand calculations instead of using Demand Planning.\n      This is the default setting for new item records.\n      Orders are created based on replenishment reminders generated from the Order Items page, Replenish Items, and Mass Create Work Orders.\n    * Time Phased &#x2013; To create orders based on item demand plans instead of the Advanced Inventory Management settings.\n      When you choose this setting, other fields on the record that are used by Advanced Inventory Management to calculate demand are no longer available. These unavailable fields are: Seasonal Demand, Build Point, Reorder Point, Preferred Stock Level, Safety Stock Days.\n      The Auto calculate settings are cleared and cannot be changed for Demand Per Day, Reorder Point, Preferred Stock Level, Lead Time."
    },
    {
      "id": "supplytimefence",
      "type": "integer",
      "nlapiSubmitField": false,
      "label": "Planning Time Fence",
      "required": false,
      "help": "This field defaults to the number entered in the Default Planning Time Fence field. Verify the default or enter a number between zero and 365 to determine the planning time fence for this item."
    },
    {
      "id": "taxable",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Taxable",
      "required": false,
      "help": ""
    },
    {
      "id": "taxschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Tax Schedule",
      "required": true,
      "help": "Select the tax schedule you want to apply to this item.\n\nYou can create new tax schedules at Setup > Accounting > Taxes > Tax Schedules > New."
    },
    {
      "id": "templatesgroup",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Templates",
      "required": false,
      "help": ""
    },
    {
      "id": "totalvalue",
      "type": "currency",
      "nlapiSubmitField": false,
      "label": "Total Value",
      "required": false,
      "help": "Enter or accept the total value of this item. NetSuite generates this amount by multiplying your purchase price and your quantity on hand.\n\nAs you buy and sell additional inventory, NetSuite continues to calculate the total value."
    },
    {
      "id": "tracklandedcost",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Track Landed Cost",
      "required": false,
      "help": "Check this box to track landed costs associated with this item.\n\nNote: You must include an item that tracks landed costs on transactions you want to source for landed costs.\n\nFor example, on the Landed Costs subtab of item receipts, a vendor bill shows in the source transaction list only if the bill includes a landed cost item."
    },
    {
      "id": "transferprice",
      "type": "currency2",
      "nlapiSubmitField": false,
      "label": "Transfer Price",
      "required": false,
      "help": "Enter a transfer price on an item record to set the default value used as the transfer price on transfer orders. You can still override this default by entering a new transfer price for an item on the transfer order.\n\nThe use of the value in the Transfer Price field on a transfer order depends on your setting for the Use Item Cost as Transfer Cost preference.\n\nWhen the Use Item Cost as Transfer Cost preference is enabled, the transfer price on a transfer order is not considered for posting cost accounting of line items. In the Transfer Price field, enter a declared value for the item to be used for shipping purposes only.\n\nWhen the Use Item Cost as Transfer Cost preference is disabled, the transfer price on a transfer order is considered for posting cost accounting of line items. Items that do not have a transfer price set on a transfer order use a zero value for cost accounting calculations when the item is received.\n\nNote: If the Transfer Price field is blank on the item record, a value of zero shows by default on the transfer order. Unless a transfer price value is entered on the transfer order, a value of zero is used for COGS calculations when the item is received."
    },
    {
      "id": "transferpriceunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "unitstype",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Units Type",
      "required": false,
      "help": "Select the type of units you use to purchase, stock and sell this item."
    },
    {
      "id": "upccode",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "UPC Code",
      "required": false,
      "help": "Enter a maximum of 999 characters in this field to identify an internal name or number to store the item's UPC Code. You can use the text you enter here when adding the item to transactions, searching, or viewing reports.\n    * When you enter text in this field, the SKU/UPC field on item labels displays this UPC Code and prints in UPC bar code format.\n    * When this field is clear, the SKU/UPC field on item labels displays the Item Name/Number and prints in Code-128 bar code format."
    },
    {
      "id": "urlcomponent",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "URL Component",
      "required": false,
      "help": "Enter a short, descriptive name for this item to appear as part of its URL in the Web store.\n\nSetting a name to show in the URL can result in better ranking from search engines.\n\nIf you leave this field blank, NetSuite terms and numbers are used as identifiers in the URL.\n\nNote: Descriptive URL components are case sensitive. Descriptive URLs must match the case used in the URL Component field of an item record to point to the correct page."
    },
    {
      "id": "usebins",
      "type": "checkbox",
      "nlapiSubmitField": true,
      "label": "Use Bins",
      "required": false,
      "help": "Check this box to track bin locations for this item.\n\nIf you choose to use bins for this item, you must associate at least one bin with the item using the Bin Numbers subtab.\n\nYou can associate multiple items with one bin and multiple bins with one item. You can also designate one preferred bin per location. The preferred bin is listed by default on receipt and fulfillment transactions.\n\nTo create bin records that can be selected here, go to <_TABNAME=EDIT_BINNUMBERRECORD_> > <_TASKCATEGORY=EDIT_BINNUMBERRECORD_> > Bins > New."
    },
    {
      "id": "usemarginalrates",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Use Marginal Rates",
      "required": false,
      "help": "Check this box if you want the quantity discounts in the schedule to be applied to each pricing bracket separately.\n\nFor example, a schedule offers no discount for the first 100 items sold and a 5% discount if more than 100 are sold. If 150 items are sold, the first 100 are at normal price, and the other fifty items are sold at 5% discount.\n\nLeave this box clear if you want the discount to apply to all of the items sold."
    },
    {
      "id": "vendorname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Vendor Name/Code",
      "required": false,
      "help": "If your vendor uses a name for this item that is different from the name you use, you can enter up to 60 characters as the vendor's name for this item here.\n\nThe vendor's name for this item prints in the Item column of purchase forms.\n\nIf you do not enter a vendor name, the item name prints in the Item column of purchase forms. If you have entered a display name, it will print on purchases instead of the item name."
    },
    {
      "id": "vendreturnvarianceaccount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Vendor Return Variance Account",
      "required": false,
      "help": ""
    },
    {
      "id": "vsoedeferral",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Deferral",
      "required": false,
      "help": "In the Deferral field, choose how to handle deferment when this item is sold as part of a bundle:\n\n    * Defer Bundle Until Delivered &#x2013; Until this item is marked delivered, item revenue recognition in the bundle is deferred.\n\n      A typical use for this option is to identify items whose revenue recognition depends on the delivery of the item in addition to the delivery of a separate service. For example, a specified upgrade would typically be marked Defer Bundle Until Delivered.\n\n    * Defer Until Item Delivered &#x2013; Until this item is marked delivered, the item revenue recognition is deferred. This is the default field setting.\n\nNote: The deferral setting you choose for each item in a bundle works with the deferral settings for other items in the bundle."
    },
    {
      "id": "vsoedelivered",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Default as Delivered",
      "required": false,
      "help": "Check this box to automatically set this item to a Delivered status when this item is added to a transaction. Clear this box to leave the delivery status clear by default."
    },
    {
      "id": "vsoepermitdiscount",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Permit Discount",
      "required": false,
      "help": "Choose from the following options to determine how discounts are handled for this item.\n    * As Allowed - Allows a portion of an applicable discount to be applied against this item if its status is delivered when revenue allocation is performed.\n    * Never - Prevents a discount from being applied against this item when revenue allocation is performed.\n\nWhen you use advanced revenue management, items with VSOE values never permit discount if the residual method is used."
    },
    {
      "id": "vsoeprice",
      "type": "currency2",
      "nlapiSubmitField": false,
      "label": "VSOE Price",
      "required": false,
      "help": "Enter the VSOE Price for this item if it is known.\n\nNote: If you need to use more than one VSOE price for an item, you can set the most common price here and then change the price on each order manually."
    },
    {
      "id": "vsoesopgroup",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Allocation Type",
      "required": false,
      "help": "Select an allocation type to associate with this item on sales transactions.\n\n    * Normal - Revenue allocation follows EITF 08-01 rules when you use VSOE and the fair value price list with advanced revenue management.\n    * Exclude - This item is excluded from revenue allocation. The item discounted sales amount is the revenue amount.\n    * Software - The item is software. When you use VSOE with the EITF SuiteApp, both EITF 08-01 and SOP 97-2 rules apply for revenue allocation. When you use advanced revenue management, revenue allocation follows the fair value price list. Then if the fair value prices for any of the items in the allocation are estimates rather than VSOE, the allocation is recalculated using the residual method.\n\nNote: Do not select the Software value unless you are using VSOE with the EITF SuiteApp or Advanced Revenue Management."
    },
    {
      "id": "weight",
      "type": "float",
      "nlapiSubmitField": false,
      "label": "Item Weight",
      "required": false,
      "help": "Enter the weight of this item and select the units in the dropdown."
    },
    {
      "id": "weightunit",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "weightunits",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "willship",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Will Ship to the US and the following:",
      "required": false,
      "help": ""
    },
    {
      "id": "yahooproductfeed",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    }
  ],
  "sublists": [
    {
      "id": "accountingbookdetail",
      "label": "Accounting Books",
      "fields": [
        {
          "id": "accountingbook",
          "type": "select",
          "label": "Accounting Book",
          "required": false,
          "help": ""
        },
        {
          "id": "amortizationtemplate",
          "type": "select",
          "label": "Amortization Template",
          "required": false,
          "help": ""
        },
        {
          "id": "createrevenueplanson",
          "type": "select",
          "label": "Create Revenue Plans On",
          "required": false,
          "help": ""
        },
        {
          "id": "revenuerecognitionrule",
          "type": "select",
          "label": "Revenue Recognition Rule",
          "required": false,
          "help": ""
        },
        {
          "id": "revrecforecastrule",
          "type": "select",
          "label": "Rev Rec Forecast Rule",
          "required": false,
          "help": ""
        },
        {
          "id": "revrecschedule",
          "type": "select",
          "label": "Revenue Recognition Template",
          "required": false,
          "help": ""
        },
        {
          "id": "sameasprimaryamortization",
          "type": "checkbox",
          "label": "Same as Primary Book Amortization",
          "required": false,
          "help": ""
        },
        {
          "id": "sameasprimaryrevrec",
          "type": "checkbox",
          "label": "Same as Primary Book Rev Rec",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "binnumber",
      "label": "Bin Numbers",
      "fields": [
        {
          "id": "binnumber",
          "type": "select",
          "label": "Bin Number",
          "required": true,
          "help": ""
        },
        {
          "id": "location",
          "type": "text",
          "label": "",
          "required": false,
          "help": ""
        },
        {
          "id": "locationactive",
          "type": "text",
          "label": "Location Active",
          "required": false,
          "help": ""
        },
        {
          "id": "onhand",
          "type": "float",
          "label": "On Hand",
          "required": false,
          "help": ""
        },
        {
          "id": "onhandavail",
          "type": "float",
          "label": "Available",
          "required": false,
          "help": ""
        },
        {
          "id": "preferredbin",
          "type": "checkbox",
          "label": "Preferred (per Location)",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "itemvendor",
      "label": "Vendors",
      "fields": [
        {
          "id": "itemvendorprice",
          "type": "summary",
          "label": "Purchase Prices",
          "required": false,
          "help": ""
        },
        {
          "id": "preferredvendor",
          "type": "checkbox",
          "label": "Preferred",
          "required": false,
          "help": ""
        },
        {
          "id": "purchaseprice",
          "type": "rate",
          "label": "Purchase Price",
          "required": false,
          "help": ""
        },
        {
          "id": "schedule",
          "type": "select",
          "label": "Schedule",
          "required": false,
          "help": ""
        },
        {
          "id": "subsidiary",
          "type": "text",
          "label": "Subsidiary",
          "required": false,
          "help": ""
        },
        {
          "id": "vendor",
          "type": "select",
          "label": "Vendor",
          "required": true,
          "help": ""
        },
        {
          "id": "vendorcode",
          "type": "text",
          "label": "Code",
          "required": false,
          "help": ""
        },
        {
          "id": "vendorcurrencyname",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "locations",
      "label": "Locations",
      "fields": [
        {
          "id": "backwardconsumptiondays",
          "type": "integer",
          "label": "Backward Consumption Days",
          "required": false,
          "help": ""
        },
        {
          "id": "defaultreturncost",
          "type": "currency2",
          "label": "Default Return Cost",
          "required": false,
          "help": ""
        },
        {
          "id": "demandsource",
          "type": "select",
          "label": "Demand Source",
          "required": false,
          "help": ""
        },
        {
          "id": "demandtimefence",
          "type": "integer",
          "label": "Demand Time Fence",
          "required": false,
          "help": ""
        },
        {
          "id": "fixedlotsize",
          "type": "posfloat",
          "label": "Fixed Lot Size",
          "required": false,
          "help": ""
        },
        {
          "id": "forwardconsumptiondays",
          "type": "integer",
          "label": "Forward Consumption Days",
          "required": false,
          "help": ""
        },
        {
          "id": "location",
          "type": "integer",
          "label": "",
          "required": false,
          "help": ""
        },
        {
          "id": "locationallowstorepickup",
          "type": "checkbox",
          "label": "Allow Store Pickup",
          "required": false,
          "help": ""
        },
        {
          "id": "locationstorepickupbufferstock",
          "type": "float",
          "label": "Store Pickup Buffer Stock",
          "required": false,
          "help": ""
        },
        {
          "id": "periodiclotsizedays",
          "type": "integer",
          "label": "Periods of Supply Increment",
          "required": false,
          "help": ""
        },
        {
          "id": "periodiclotsizetype",
          "type": "select",
          "label": "Periods of Supply Type",
          "required": false,
          "help": ""
        },
        {
          "id": "preferredstocklevel",
          "type": "float",
          "label": "Preferred Stock Level",
          "required": false,
          "help": ""
        },
        {
          "id": "reorderpoint",
          "type": "float",
          "label": "Reorder Point",
          "required": false,
          "help": ""
        },
        {
          "id": "rescheduleindays",
          "type": "integer",
          "label": "Reschedule In Days",
          "required": false,
          "help": ""
        },
        {
          "id": "rescheduleoutdays",
          "type": "integer",
          "label": "Reschedule Out Days",
          "required": false,
          "help": ""
        },
        {
          "id": "supplylotsizingmethod",
          "type": "select",
          "label": "Lot Sizing Method",
          "required": false,
          "help": ""
        },
        {
          "id": "supplytimefence",
          "type": "integer",
          "label": "Planning Time Fence",
          "required": false,
          "help": ""
        },
        {
          "id": "supplytype",
          "type": "select",
          "label": "Supply Type",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "price1",
      "label": "US Dollar",
      "fields": [
        {
          "id": "currency",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        },
        {
          "id": "discount",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "discountdisplay",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "pricelevel",
          "type": "text",
          "label": "Price Level",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "price2",
      "label": "British pound",
      "fields": [
        {
          "id": "currency",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        },
        {
          "id": "discount",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "discountdisplay",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "pricelevel",
          "type": "text",
          "label": "Price Level",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "price3",
      "label": "Canadian Dollar",
      "fields": [
        {
          "id": "currency",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        },
        {
          "id": "discount",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "discountdisplay",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "pricelevel",
          "type": "text",
          "label": "Price Level",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "price4",
      "label": "Euro",
      "fields": [
        {
          "id": "currency",
          "type": "text",
          "label": "Currency",
          "required": false,
          "help": ""
        },
        {
          "id": "discount",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "discountdisplay",
          "type": "percent",
          "label": "Default Discount %",
          "required": false,
          "help": ""
        },
        {
          "id": "pricelevel",
          "type": "text",
          "label": "Price Level",
          "required": false,
          "help": ""
        }
      ]
    },
    {
      "id": "sitecategory",
      "label": "Web Site Categories",
      "fields": [
        {
          "id": "category",
          "type": "select",
          "label": "Site Category",
          "required": true,
          "help": ""
        },
        {
          "id": "categorydescription",
          "type": "text",
          "label": "Description",
          "required": false,
          "help": ""
        },
        {
          "id": "isdefault",
          "type": "checkbox",
          "label": "Preferred Category",
          "required": false,
          "help": ""
        },
        {
          "id": "website",
          "type": "select",
          "label": "Site",
          "required": true,
          "help": ""
        }
      ]
    },
    {
      "id": "translations",
      "label": "Translation",
      "fields": [
        {
          "id": "displayname",
          "type": "text",
          "label": "Display Name",
          "required": false,
          "help": ""
        },
        {
          "id": "featureddescription",
          "type": "textarea",
          "label": "Featured Description",
          "required": false,
          "help": ""
        },
        {
          "id": "language",
          "type": "text",
          "label": "Language",
          "required": false,
          "help": ""
        },
        {
          "id": "locale",
          "type": "text",
          "label": "",
          "required": false,
          "help": ""
        },
        {
          "id": "nopricemessage",
          "type": "textarea",
          "label": "No Price Message",
          "required": false,
          "help": ""
        },
        {
          "id": "outofstockmessage",
          "type": "textarea",
          "label": "Out Of Stock Message",
          "required": false,
          "help": ""
        },
        {
          "id": "pagetitle",
          "type": "textarea",
          "label": "Page Title",
          "required": false,
          "help": ""
        },
        {
          "id": "salesdescription",
          "type": "textarea",
          "label": "Sales Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedescription",
          "type": "textarea",
          "label": "Store Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedetaileddescription",
          "type": "textarea",
          "label": "Detailed Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedisplayname",
          "type": "text",
          "label": "Store Display Name",
          "required": false,
          "help": ""
        }
      ]
    }
  ],
  "searchFilters": [],
  "searchColumns": [],
  "searchJoins": [],
  "searchData": "item",
  "tabs": [
    {
      "name": "basic",
      "label": "Basic"
    },
    {
      "name": "custom",
      "label": "Custom"
    },
    {
      "name": "history",
      "label": "History"
    },
    {
      "name": "inventory",
      "label": "Inventory"
    },
    {
      "name": "inventorydetail",
      "label": "Inventory Detail"
    },
    {
      "name": "inventorynumbers",
      "label": "Inventory Numbers"
    },
    {
      "name": "matrix",
      "label": "Matrix"
    },
    {
      "name": "pricing",
      "label": "Pricing"
    },
    {
      "name": "relitems",
      "label": "Related Items"
    },
    {
      "name": "specials",
      "label": "Specials"
    },
    {
      "name": "store",
      "label": "Store"
    },
    {
      "name": "translation",
      "label": "Translation"
    },
    {
      "name": "vsoepricing",
      "label": "Rev Rec / Amort"
    },
    {
      "name": "workflow",
      "label": "Workflow"
    }
  ],
  "transformTypes": []
}