{
  "label": "Markup Item",
  "id": "markupitem",
  "supportCustomFields": true,
  "searchOnly": false,
  "supportDeletedRecordSearch": false,
  "fields": [
    {
      "id": "account",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "",
      "required": true,
      "help": "If you clicked Deposit To Account above, now select the appropriate account."
    },
    {
      "id": "availabletopartners",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Available to Adv. Partners",
      "required": false,
      "help": "Check this box to make this item available to partners with the Advanced Partner Center role for viewing.\n\nThese items are also available to partners with roles that are customized for the Advanced Partner Center and include view, create or edit access to item records."
    },
    {
      "id": "class",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Class",
      "required": false,
      "help": "Select a class to associate with this item.\n\nClick New to enter a new class record.\n\nGo to <_TABNAME=LIST_CLASS_> > <_TASKCATEGORY=LIST_CLASS_> > Classes for details about existing class records."
    },
    {
      "id": "createddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Date Created",
      "required": false,
      "help": ""
    },
    {
      "id": "customform",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Custom Form",
      "required": false,
      "help": "Select the form you want to use to enter this record.\n\nYou can select the standard form, a custom form you have already created, or select New to create a custom form."
    },
    {
      "id": "department",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Department",
      "required": false,
      "help": "Choose a department to associate with this item.\n\nClick New to enter a new department record.\n\nGo to <_TABNAME=LIST_DEPARTMENT_> > <_TASKCATEGORY=LIST_DEPARTMENT_> > Departments for details about existing department records."
    },
    {
      "id": "description",
      "type": "textarea",
      "nlapiSubmitField": false,
      "label": "Description",
      "required": false,
      "help": "Enter a description for this item. This description will appear in the Description column of sales forms."
    },
    {
      "id": "displayname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Display Name/Code",
      "required": false,
      "help": "You can enter an optional name for this item in addition to the Item Name. If you are integrating with a Yahoo! store, this field is imported from Yahoo!.\n\nThe display name prints in the Item column of sales forms. If this item is a member of a kit, this name appears in the Item column when the Print Items box is checked.\n\nIf you do not enter a display name, the item name appears on printed forms."
    },
    {
      "id": "externalid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "ExternalId",
      "required": false,
      "help": ""
    },
    {
      "id": "includechildren",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Include Children",
      "required": false,
      "help": "Check the Include Children box to share the item with all the sub-subsidiaries associated with each subsidiary selected in the Subsidiary field.\n\nNote: When sharing items across subsidiaries, all of the options selected on the item record must be compatible across subsidiaries.\n \nFor example, when entering an inventory item to be shared across subsidiaries, you should select Income and Asset accounts on the item record that are also shared across the same subsidiaries."
    },
    {
      "id": "isinactive",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Inactive",
      "required": false,
      "help": "When you check this box, this item will no longer appear on a list unless you check the Show All box at the bottom of the list page."
    },
    {
      "id": "ispretax",
      "type": "checkbox",
      "nlapiSubmitField": false,
      "label": "Apply Before Sales Tax",
      "required": false,
      "help": "Check this box to apply this markup or discount before taxes are calculated.\n\nImportant: This option is only for use in countries that levy sales tax; for example, the United States. In OneWorld accounts, this checkbox does not have any effect on countries that use value-added tax (VAT). However, this option can be used for Brazil, China, and India. For more information, see the Help topic Applying Sales Tax or VAT to Discount Items"
    },
    {
      "id": "issueproduct",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Product",
      "required": false,
      "help": "Select the product this item is associated with.\n\nProduct records are tracked with versions and builds for issue management.\n\nTo create product records, go to <_TABNAME=ADMI_ISSUEPRODUCT_> > <_TASKCATEGORY=ADMI_ISSUEPRODUCT_> > Products > New."
    },
    {
      "id": "itemid",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Item Name/Number",
      "required": true,
      "help": "Type up to 60 characters for the name of this item. This name appears in lists on transactions.\n\nIf you have the option of entering a display name and do not, the item name prints in the Item column of sales forms.\n\nIf you have the option to enter a vendor name and do not, the item name prints in the Item column of purchase forms. If you have entered a display name, it will print on purchases instead of the item name."
    },
    {
      "id": "itemtype",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "",
      "required": false,
      "help": ""
    },
    {
      "id": "lastmodifieddate",
      "type": "datetime",
      "nlapiSubmitField": false,
      "label": "Last Modified",
      "required": false,
      "help": ""
    },
    {
      "id": "location",
      "type": "select",
      "nlapiSubmitField": true,
      "label": "Location",
      "required": false,
      "help": "Select a location to associate with this item.\nTo use a location, the Multi-Location Inventory feature must be enabled.\n\n    * If the Multi-Location Inventory feature is not enabled:\n\n      Selecting an item record location limits the items that certain roles can access.\n      For example, Role A is set up to access only items associated with Location One. Therefore, employees who have Role A can access only items associated with Location One.\n\n      Note: If the Multi-Location Inventory feature is not enabled, you cannot use this field to track inventory by locations. For example, you cannot track how many widgets you have in stock in Location One.\n\n      For more information click here.\n\n    * If the Multi-Location Inventory feature is enabled:\n\n      Selecting an item record location classifies the item by that location to limit the items that certain roles can access. To track inventory per location, use the Locations subtab at the bottom of this form.\n\n      For more information click here.\n\nSelect New to enter a new location record.\n\nGo to <_TABNAME=LIST_LOCATION_> > <_TASKCATEGORY=LIST_LOCATION_> > Locations for details about existing location records."
    },
    {
      "id": "nonposting",
      "type": "radio",
      "nlapiSubmitField": false,
      "label": "Non-posting",
      "required": false,
      "help": "Select Non-Posting if this discount item should not post to a general ledger account.\n\nWhen a discount item is marked non-posting, it does not post as an individual transaction line. The item it is applied to posts the net amount after the discount.\nWhen you create a sales transaction and add the non-posting discount after a line-item, the discount is applied to the previous line-item only.\n\n    * If a 10% non-posting discount is applied to a $100 line item, the amount of revenue that posts to the associated revenue account for that item is $90.\n    * If a 10% posting discount is applied to a $100 line item, the amount of revenue that posts to the associated revenue account for that item is $100. Also, an offsetting debit amount of $10 posts to the related discount account, such as the Sales Discounts account.\n\nFor Non-posting discounts, select an account the discount amount posts to.\n\nNote: You cannot select Non-Posting when creating a Discount for Purchase item."
    },
    {
      "id": "parent",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subitem of",
      "required": false,
      "help": "If you want this item to be a subitem, select the parent item here."
    },
    {
      "id": "rate",
      "type": "rate",
      "nlapiSubmitField": false,
      "label": "Rate",
      "required": true,
      "help": "Enter the rate for this discount or markup. The rate can be either a percentage or dollar amount.\n\nA percentage discount must be followed by a % sign.\n\nA dollar amount should be entered as a positive number."
    },
    {
      "id": "subsidiary",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Subsidiary",
      "required": false,
      "help": ""
    },
    {
      "id": "taxschedule",
      "type": "select",
      "nlapiSubmitField": false,
      "label": "Tax Schedule",
      "required": false,
      "help": "Select the tax schedule you want to apply to this item.\n\nYou can create new tax schedules at Setup > Accounting > Taxes > Tax Schedules > New."
    },
    {
      "id": "upccode",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "UPC Code",
      "required": false,
      "help": "Enter a maximum of 999 characters in this field to identify an internal name or number to store the item's UPC Code. You can use the text you enter here when adding the item to transactions, searching, or viewing reports.\n    * When you enter text in this field, the SKU/UPC field on item labels displays this UPC Code and prints in UPC bar code format.\n    * When this field is clear, the SKU/UPC field on item labels displays the Item Name/Number and prints in Code-128 bar code format."
    },
    {
      "id": "vendorname",
      "type": "text",
      "nlapiSubmitField": false,
      "label": "Vendor Name/Code",
      "required": false,
      "help": "If your vendor uses a name for this item that is different from the name you use, you can enter up to 60 characters as the vendor's name for this item here.\n\nThe vendor's name for this item prints in the Item column of purchase forms.\n\nIf you do not enter a vendor name, the item name prints in the Item column of purchase forms. If you have entered a display name, it will print on purchases instead of the item name."
    }
  ],
  "sublists": [
    {
      "id": "translations",
      "label": "Translation",
      "fields": [
        {
          "id": "displayname",
          "type": "text",
          "label": "Display Name",
          "required": false,
          "help": ""
        },
        {
          "id": "featureddescription",
          "type": "textarea",
          "label": "Featured Description",
          "required": false,
          "help": ""
        },
        {
          "id": "language",
          "type": "text",
          "label": "Language",
          "required": false,
          "help": ""
        },
        {
          "id": "locale",
          "type": "text",
          "label": "",
          "required": false,
          "help": ""
        },
        {
          "id": "nopricemessage",
          "type": "textarea",
          "label": "No Price Message",
          "required": false,
          "help": ""
        },
        {
          "id": "outofstockmessage",
          "type": "textarea",
          "label": "Out Of Stock Message",
          "required": false,
          "help": ""
        },
        {
          "id": "pagetitle",
          "type": "textarea",
          "label": "Page Title",
          "required": false,
          "help": ""
        },
        {
          "id": "salesdescription",
          "type": "textarea",
          "label": "Sales Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedescription",
          "type": "textarea",
          "label": "Store Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedetaileddescription",
          "type": "textarea",
          "label": "Detailed Description",
          "required": false,
          "help": ""
        },
        {
          "id": "storedisplayname",
          "type": "text",
          "label": "Store Display Name",
          "required": false,
          "help": ""
        }
      ]
    }
  ],
  "searchFilters": [],
  "searchColumns": [],
  "searchJoins": [],
  "searchData": "item",
  "tabs": [
    {
      "name": "basic",
      "label": "Basic"
    },
    {
      "name": "custom",
      "label": "Custom"
    },
    {
      "name": "history",
      "label": "History"
    },
    {
      "name": "workflow",
      "label": "Workflow"
    }
  ],
  "transformTypes": []
}